nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			 if(1==Recode_Obj.SD_Data_Flag)
			 	{
                   Stuff_RecoderACK_0700H();   //   行车记录仪数据上传  
                   Recode_Obj.SD_Data_Flag=0;
                   return true;  
			 	} 
			 if(SD_ACKflag.f_MsgBroadCast_0303H==1)
			 	{
                   Stuff_MSGACK_0303H(); 
                   SD_ACKflag.f_MsgBroadCast_0303H=0;
                   return true;
			 	}
			 if(1==MediaObj.SD_media_Flag)
			 	{
				   Stuff_MultiMedia_InfoSD_0800H();
				   MediaObj.SD_media_Flag=0;
                   return true;    
			 	}	
             if(DataTrans.Data_TxLen)
             	{ 
                  Stuff_DataTransTx_0900H();  // 数据透传 做远程下载
                  DataTrans_Init();     //clear 
                  return true;
             	} 		
             if(SD_ACKflag.f_MediaIndexACK_0802H)
             	{
                   Stuff_MultiMedia_IndexAck_0802H();   // 多媒体索引上报 
                   SD_ACKflag.f_MediaIndexACK_0802H=0;
				   return true;
             	}			 
			 if(SD_ACKflag.f_DriverInfoSD_0702H)
			 	{
			 	   Stuff_DriverInfoSD_0702H();  //  驾驶员信息上报
                   SD_ACKflag.f_DriverInfoSD_0702H=0;
                   return true;
			 	}
			  if(SD_ACKflag.f_Worklist_SD_0701H)
			 	{
			 	   Stuff_Worklist_0701H();  //   电子运单 
                   SD_ACKflag.f_Worklist_SD_0701H=0;
                   return true;
			 	}
	        if(SD_ACKflag.f_CentreCMDack_0001H)
	         {
                               Stuff_DevCommmonACK_0001H();        
				   if(SD_ACKflag.f_CentreCMDack_0001H==2)  //  修改IP设置了需要重拨
				   	   Close_DataLink();    //  AT_END    
				   else	   
				   if(SD_ACKflag.f_CentreCMDack_0001H==3) //   远程复位
				   	{
                                       Systerm_Reset_counter=Max_SystemCounter;
					  ISP_resetFlag=2;    //   借助远程下载重启机制复位系统
				   	}
				   else
				   if(SD_ACKflag.f_CentreCMDack_0001H==5) //   关闭数据通信
				   	{
				   	   Close_DataLink();  
                                      Stop_Communicate();      
				   	}				 
                               SD_ACKflag.f_CentreCMDack_0001H=0; 
				   SD_ACKflag.f_CentreCMDack_resualt=0;    
                   
				   
                   return true;    
				}  	 
	        if(SD_ACKflag.f_SettingPram_0104H)
	        	{
	        	  Stuff_SettingPram_0104H();
                  SD_ACKflag.f_SettingPram_0104H=0;
				   return true;
	        	}	

	     //----------   远程下载相关 ------------		
            if((1==f_ISP_ACK)&&(1==TCP2_Connect))
             	{
				   Stuff_DataTrans_0900_ISP_ACK(ISPACK_92);
				   f_ISP_ACK=0;
				   return true;
             	} 
		    if((1==f_ISP_23_ACK)&&(1==TCP2_Connect)) 
             	{
				   Stuff_DataTrans_0900_ISP_ACK(ISPoverACK_96);  
				   
				   crc_file=CRC16_file(ISP_total_packnum); 
				   
				   if(crc_file==FileTCB_CRC16)
						ISP_file_Check();//准备更新程序
				   else
						{    // 清除远程升级区域 
						     
							 rt_kprintf("\r\n检验不对清除  Caculate_crc=%x ReadCrc=%x ",crc_file,FileTCB_CRC16); 
						        DF_ClearUpdate_Area();   
						}
							   
				   f_ISP_23_ACK=0;
				   return true; 
             	}
			//---------------------------------------------------
			 if((1==f_ISP_88_ACK)&&(1==TCP2_Connect))
                    {	
				Stuff_DataTrans_0900_ISP_ACK(ISPinfoACK_94);
				rt_kprintf( "\r\n CurrentPack_num:%u TotalPack_num %u \r\n",ISP_current_packnum,ISP_total_packnum); 
			 	f_ISP_88_ACK=0;
				return true;
			  }	
	            if((1==TCP2_Connect)&&(TCP2_sdFlag==1)&&(ISP_running_state==0))
		   	{
		   	      
                          Stuff_RegisterPacket_0100H(1);  //    ISP 心跳包  
                          rt_kprintf("\r\nISP--heart\r\n"); 
                          TCP2_sdFlag=0;
                           return true;
		   	}
	         //----------------------远程下载相关完毕------------------ 		
			
			// if((Current_SD_Duration<=10)||(Current_State==1))   // 调试时30  实际是10 Current_SD_Duration
			// {	
		      if(PositionSD_Status()&&(DEV_Login.Operate_enable==2)&&((enable==BD_EXT.Trans_GNSS_Flag)||(DispContent==6))||(Current_UDP_sd&&PositionSD_Status())||((DF_LOCK==enable)&&PositionSD_Status()))	  //首次定位再发 
			   //  if((PositionSD_Status())&&(DataLink_Status())&&(DEV_Login.Operate_enable==2))	                                                                                                                     // DF  锁定发送当前位置信息  
		      {
				   //---------------------------------------------------------------------------------
				   PositionSD_Disable();
				   Current_UDP_sd=0; 
                              //1.   时间超前判断
                              //if(Time_FastJudge()==false)
					//		return false;		
				  // 2. 			  
			 	   Stuff_Current_Data_0200H();  // 上报即时数据  

				   if(ReadFail_sd_current)
				   	{    
				   	      rt_kprintf("\r\n read fail send !\r\n");    
				             ReadFail_sd_current=0;
				   	}
				   if(DispContent)	
					    rt_kprintf("\r\n 发送 GPS -current !\r\n");     
			    }   
			 //}
		      else 
             if((RdCycle_RdytoSD==ReadCycle_status)&&(0==ISP_running_state)&&(DataLink_Status())&&(DEV_Login.Operate_enable==2))    // 读取发送--------- 正常GPS 
             {                                       /* 远程下载时不允许上报GPS ，因为有可能发送定位数据时
                                                          正在接收大数据量得下载数据包,导致GSM模块处理不过来，而不是单片机处理不过来*/
                 if (false==Stuff_Normal_Data_0200H())        
				 	return false;
				 //-------- change status  Ready  ACK  ------ 
			         ReadCycle_status=RdCycle_SdOver;
				  Send_Rdy4ok=1;  // enable
				  //----应答次数 ----		  
				   if(DispContent)	
					  rt_kprintf("\r\n 发送 GPS --saved  OK!\r\n");    
				 return true; 
             }			 
 			//-------------------------------------------------------------
			return  false; 
             
}
void strtrim(u8 *s, u8 c)
{
	u8		 *p1, *p2;
	u16  i, j;

	if (s == 0) return;

	// delete the trailing characters
	if (*s == 0) return;
	j = strlen((char const *)s);
	p1 = s + j;
	for (i = 0; i < j; i++)
	{
	   	p1--;
	   	if (*p1 != c) break;
	}
	if (i < j) p1++;
	*p1 = 0;	// null terminate the undesired trailing characters

	// delete the leading characters
  	p1 = s;
	if (*p1 == 0) return;
	for (i = 0; *p1++ == c; i++);
	if (i > 0)
	{
		p2 = s;
	 	p1--;
		for (; *p1 != 0;) *p2++ = *p1++;
		*p2 = 0;
	}
} 

int str2ip(char *buf, u8 *ip)
{	// convert an ip:port string into a binary values
	int	i;
	u16	_ip[4]; 
	

	memset(_ip, 0, sizeof(_ip));

