nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			 }
		 else		 
			 {
			     if(JT808Conf_struct.Speed_GetType==0)
			          GPS_speed=0;
			 }
	 
		 // --------  sp 当前是0.1 knot------------------	 
		  sp= (u32)(sp * 185.6) ;  //  1 海里=1.856 千米  现在是m/h
								 
		  if(sp>220000)   //时速大于220km/h则剔除
			  return;  
	 
		  sp_DISP=sp/100;   //  sp_Disp 单位是 0.1km/h 




							  
	         //------------------------------ 通过GPS模块数据获取到的速度 --------------------------------
	        if(Satelite_num>=5)   // 北斗模块漂移，不超过5颗星不给速度
                       Speed_gps=(u16)sp_DISP; 
	         //---------------------------------------------------------------------------

 



	   if(JT808Conf_struct.Speed_GetType)  // 通过速度传感器 获取速度
       	{ 
              K_AdjustUseGPS(sp,sp_DISP);  //  调整K值    
              if(JT808Conf_struct.DF_K_adjustState==0)
			  {
			     // ---  在未校准前，获得到的速度是通过GPS计算得到的
			     GPS_speed=Speed_gps;      
			       //------- GPS	里程计算-------- 
				 if(sp>=5000)		//	过滤零点漂移  速度大于
				 {
					 reg=sp/3600;  // 除以3600 是m/s 
					 JT808Conf_struct.Distance_m_u32+=reg;
					 if(JT808Conf_struct.Distance_m_u32>0xFFFFFF)
							  JT808Conf_struct.Distance_m_u32=0; 	  //里程最长这么多米	

					 //----- 定距回传处理---  
                     if(1==JT808Conf_struct.SD_MODE.DIST_TOTALMODE)
                     {
                        DistanceAccumulate+=reg;
                        if(DistanceAccumulate>=Current_SD_Distance)
                        	{
                               DistanceAccumulate=0;
				   PositionSD_Enable();        //发送
				   Current_UDP_sd=1;
                        	}
                     }
					 //------- 定距处理结束 -----
							  
				 }	
				
              }  
       	}  
	   else
	   	{  // 从GPS 取速度
			     //------- GPS	里程计算-------- 
				 if(sp>=5000)		//	过滤零点漂移  速度大于
				 {
					 JT808Conf_struct.Distance_m_u32+=sp/3600;  // 除以3600 是m/s 
					 if(JT808Conf_struct.Distance_m_u32>0xFFFFFF)
							  JT808Conf_struct.Distance_m_u32=0; 	  //里程最长这么多米	  

					 //----- 定距回传处理---  
                     if(1==JT808Conf_struct.SD_MODE.DIST_TOTALMODE)
                     {
                        DistanceAccumulate+=reg;
                        if(DistanceAccumulate>=Current_SD_Distance)
                        	{
                               DistanceAccumulate=0;
					PositionSD_Enable();          //发送
					Current_UDP_sd=1;
					  rt_kprintf("\r\n 定距回传\r\n"); 
                        	}
                     }
					 //------- 定距处理结束 -----		   
				 }			 
					
					GPS_speed=Speed_gps;    // 用GPS数据计算得的速度 单位0.1km/h
					
		            //-----------------------------------------------
					
	   	     }
			 // if(DispContent==2) 
			  //  rt_kprintf("\r\n				  速度: %d Km/h\r\n",GPS_speed/10);     
	 }
	 else if ( UDP_dataPacket_flag == 0x03 )
	 { 
       if(0==JT808Conf_struct.Speed_GetType)  
		{
			 //----- GPS 临时速度	km/h  ---------
		     GPS_speed=0;	 
       	} 
        if(JT808Conf_struct.Speed_GetType)  // 通过速度传感器 获取速度
       	{ 
              K_AdjustUseGPS(sp,sp_DISP);  //  调整K值  
              GPS_speed=Speed_cacu;      
       	}      
	   Speed_gps=0;
	   if(DispContent==2)
		   rt_kprintf("\r\n 2 GPS没定位\r\n"); 
	 }  		
	}
   //---------------------------------------------------
}


void Direction_pro(u8 *tmpinfo,u8 Invalue,u8 Point)
{
   u32	  sp=0;  
  //------------------------------------------------------------------------------------------------
  if(Invalue==INIT)
  {    
    return;
  }
  else//-------------------------------------------------------------------------------------------
  {
   GPRMC.azimuth_angle=atof((char *)tmpinfo);
	
   
   //--------------808 协议  1 度------------------------- 	 
   if ( UDP_dataPacket_flag== 0x02 )
   {	  
		  
		
		   if ( Point == 1 )   //5.8 
		   {
					  if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[2]>=0x30)&&(tmpinfo[2]<=0x39))
				   sp = ( tmpinfo[0] - 0x30 ) ;
				  else 
				   return;
				   
		   }
		   else if ( Point == 2 )  // 14.7
		   {
					  if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[1]>=0x30)&&(tmpinfo[1]<=0x39)&&(tmpinfo[3]>=0x30)&&(tmpinfo[3]<=0x39)) 
				   sp = ( tmpinfo[0] - 0x30 ) * 10 + ( tmpinfo[1] - 0x30 );
				  else
				   return;
		   
		   }
		   else    //357.38
		   if ( Point == 3 )
		   {
			      if((tmpinfo[0]>=0x30)&&(tmpinfo[0]<=0x39)&&(tmpinfo[1]>=0x30)&&(tmpinfo[1]<=0x39)&&(tmpinfo[2]>=0x30)&&(tmpinfo[2]<=0x39)&&(tmpinfo[4]>=0x30)&&(tmpinfo[4]<=0x39)) 
				   sp = ( tmpinfo[0] - 0x30 ) * 100 + ( tmpinfo[1] - 0x30 ) * 10 + ( tmpinfo[2] - 0x30 ) ;
				  else
				   return;
   
	       }
		   else
		   	{
               sp=0;   
		   	}
		   GPS_direction=sp;  //  单位 1度

	   //----------  拐点补传相关   ----------
	  // Inflexion_Process();
       
	   
		   
   }
   else if ( UDP_dataPacket_flag == 0x03 )
   {
          GPS_direction=0; 		  
 
   }


    return;
  }
 


}

void Date_pro(u8 *tmpinfo,u8 fDateModify, u8 hour, u8 min , u8 sec)
{
 uint8_t  year=0,mon=0,day=0;  
 TDateTime now;

 
 day = (( tmpinfo[0] - 0x30 ) * 10 ) + ( tmpinfo[1] - 0x30 );
 mon = (( tmpinfo[2] - 0x30 ) * 10 ) + ( tmpinfo[3] - 0x30 );
 year = (( tmpinfo[4] - 0x30 ) * 10 ) + ( tmpinfo[5] - 0x30 );
 
 if(fDateModify){
	 //sscanf(tmpinfo,"%2d%2d%2d",&day,&mon,&year);
	 day++;
	 if(mon == 2){
		 if ( ( year % 4 ) == 0 ){
			 if ( day == 30 ){day = 1;mon++;}
		 }else if ( day == 29 ){ day = 1;mon++;}
	 }else if (( mon == 4 ) || ( mon == 6 ) || ( mon == 9 ) || ( mon == 11 )){
		 if ( day == 31 ){mon++;day = 1;}
	 }else{
		 if ( day == 32 ){mon++;day = 1;}	 
		 if( mon == 13 ){mon = 1;year++; }
	 }
 }
 GPRMC.utc_year=year;
 GPRMC.utc_mon=mon;
 GPRMC.utc_day=day;
 if((sec==0)&&(GPRMC.status=='A')){
	 now.year = year;
	 now.month = mon;	   
	 now.day = day;
	 now.hour = hour;
	 now.min = min;
	 now.sec = sec;
	 now.week=1;      
	 Device_RTC_set(now);  
 }
 //------------------------------------------------ 	
 if(GPRMC.status=='A')     //  记录定位时间
{
  Time2BCD(A_time);  
  //------- Debug 存储 每秒的经纬度  || 实际应该是 存储每分钟的位置  -----   
  //  内容持续55秒每秒更新，这寄存器中记录的是在每分钟内最后一包定位的经纬度 ,预留5秒用于存储上一小时的位置 
  if(sec<55)
  	{
      memcpy(Posit[min].latitude_BgEnd,Gps_Gprs.Latitude,4); //北纬
      memcpy(Posit[min].longitude_BgEnd,Gps_Gprs.Longitude,4); //经度	  
      Posit[min].longitude_BgEnd[0]|=0x80;//  东经
  	}
  if((min==59)&&(sec==55))
    { // 每个小时的位置信息               
       NandsaveFlg.MintPosit_SaveFlag=1; 
	}  
 }   
  //---- 存储当前的起始里程  跨天时------------
   if((hour==0)&&(min==0)&&(sec==8))   // 存储3次确保存储成功   
  	{ 
	  JT808Conf_struct.DayStartDistance_32=JT808Conf_struct.Distance_m_u32;
          Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
       } 
 
 //-------------------------------------------------
      //---------  天地通协议  -------
                       
						//if(systemTick_TriggerGPS==0)
						{
					      Temp_Gps_Gprs.Date[0] = year;
					      Temp_Gps_Gprs.Date[1] = mon;
					      Temp_Gps_Gprs.Date[2] = day;   						
 						 }

  
