nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
               if((Gps_Gprs.Time[2]==20)&&(Gps_Gprs.Time[2]==50))
               {
                     PositionSD_Enable();   
			 Current_UDP_sd=1; 	 		 
			rt_kprintf("\r\n-->local time trig-30\r\n"); 		 
               }
         }
         else
          {
             local_timer++;	  
		if((SleepState==1)&&(local_timer==(Current_SD_Duration-5))&&(Current_SD_Duration>5))  //  --  休眠时 先发鉴权
		   {
			  SleepConfigFlag=1;  //发送前5 发送一包鉴权
		   }            
		
		if((local_timer >= Current_SD_Duration))//limitSend_idle
		  {
			  PositionSD_Enable();    
			  Current_UDP_sd=1; 	 
			  local_timer=0;// clear
			  rt_kprintf("\r\n-->local time trig\r\n");
		  }
          }


		
	 }	
    


}





//---------------------------------------------------------------------------------------------------
void K_AdjustUseGPS(u32 sp, u32  sp_DISP)  // 通过GPS 校准  K 值  (车辆行驶1KM 的脉冲数目) 
{
      
  u32 Reg_distance=0;
  u32 Reg_plusNum=0;
  u16 i=0;
  
  if(JT808Conf_struct.DF_K_adjustState)   // 只有没校准时才有效
			return;
		
   Speed_Rec=(u8)(sp_DISP/10);	// GPS速度    单位:km/h
   // -------	要求速度在60到65km/h  -------------
   if(((Speed_Rec>=Speed_area)&&(Speed_Rec<=(Speed_area+8)))||((Speed_Rec>=40)&&(Speed_Rec<=(40+8)))||((Speed_Rec>=70)&&(Speed_Rec<=(70+8))))   // Speed_area=60   
 // if(Speed_Rec>=Speed_area) 
//   if((Speed_Rec>=40)&&(Speed_Rec<=48))   // Speed_area=60    
   {
	   Spd_adjust_counter++;    
	   if(Spd_adjust_counter>K_adjust_Duration)  //持续在速度在60~65下认为已经是匀速了
	   {
		   // 用获取到的匀速GPS速度作为基准，和根据传感器计算出来的速度，做K值得校准
		   Reg_distance=0;	// clear
		   Reg_plusNum=0;	// clear 
		   for(i=0;i<K_adjust_Duration;i++)
		   {
			  Reg_distance+=Former_gpsSpd[i];  // 除以3.6km/h 表示该秒内走了多少米
			  Reg_plusNum+=Former_DeltaPlus[i]; 						   
		   }
           /*
                做一个判断  ， 如果速度传感器不管用， 那么返回， 
             */
           if(Reg_plusNum<20)
		   	 {
		   	   Spd_adjust_counter=0; 
			   rt_kprintf("\r\n    速度传感器 没有脉冲!\r\n");
		   	   return; 
           	 }  		   	
		   //===================================================================
		   // 转换成根据GPS速度计算行驶了多少米，(总距离) 先求和在除以3.6 ，为了计算方便 先x10  再除以36 
		   Reg_distance=(u32)(Reg_distance*10/36); // 转换成根据GPS速度计算行驶了多少米，(总距离)
		   // (Reg_plusNum/Reg_distance) 表示用脉冲总数除以距离(米)= 每米产生多少个脉冲 ，因为K值是1000米脉冲数，所以应该乘以1000
		   JT808Conf_struct.Vech_Character_Value=1000*Reg_plusNum/Reg_distance;
		   //-------  存储新的特征系数 -------------------------------- 						
		   JT808Conf_struct.DF_K_adjustState=1;					// clear  Flag
		   ModuleStatus|=Status_Pcheck;
		   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		   
		  Spd_adjust_counter=0; // clear  counter
	   }
	   else
	   {   //-------- 记录规定时间内的脉冲数和GPS速度----------
		   Former_gpsSpd[Spd_adjust_counter]=Speed_Rec; 
		   Former_DeltaPlus[Spd_adjust_counter]=Delta_1s_Plus;
	   }
  
   }  
   else
	  Spd_adjust_counter=0;  // 只要速度超出预设范围 计数器清0
}
//==================================================================================================
// 第二部分 :   以下是外部传感器状态监测
//==================================================================================================
/*    
     -----------------------------
     2.1   和协议相关的功能函数
     ----------------------------- 
*/

void IMSI_Convert_SIMCODE( void )
{
		SIM_code[0] = IMSI_CODE[3] - 0X30;
		SIM_code[0] <<= 4;
		SIM_code[0] |= IMSI_CODE[4] - 0X30;	  

		SIM_code[1] = IMSI_CODE[5] - 0X30;
		SIM_code[1] <<= 4;
		SIM_code[1] |= IMSI_CODE[6] - 0X30;	

		SIM_code[2] = IMSI_CODE[7] - 0X30;
		SIM_code[2] <<= 4;
		SIM_code[2] |= IMSI_CODE[8] - 0X30;	

		SIM_code[3] = IMSI_CODE[9] - 0X30;
		SIM_code[3] <<= 4;
		SIM_code[3] |= IMSI_CODE[10] - 0X30;	

		SIM_code[4] = IMSI_CODE[11] - 0X30;
		SIM_code[4] <<= 4;
		SIM_code[4] |= IMSI_CODE[12] - 0X30;	

		SIM_code[5] = IMSI_CODE[13] - 0X30;
		SIM_code[5] <<= 4;
		SIM_code[5] |= IMSI_CODE[14] - 0X30;
}

/*    
     -----------------------------
    2.4  不同协议状态寄存器变化
     ----------------------------- 
*/

void StatusReg_WARN_Enable(void)
{
  //     紧急报警状态下 寄存器的变化
    Warn_Status[3] |= 0x01;//BIT( 0 );		   
}

void StatusReg_WARN_Clear(void)
{
  //     清除报警寄存器  
    Warn_Status[3] &= ~0x01;//BIT( 0 );  	  	
}

void StatusReg_ACC_ON(void)
{  //    ACC 开
  Car_Status[3]|=0x01; //  Bit(0)     Set  1  表示 ACC开

}

void StatusReg_ACC_OFF(void)
{  //    ACC 关  
  
  Car_Status[3]&=~0x01; //  Bit(0)     Set  01  表示 ACC关
}

void StatusReg_POWER_CUT(void)
{  //  主电源断开
   Warn_Status[2]	|= 0x01;//BIT( 0 );
   ModuleStatus|=Status_Battery;
}

void StatusReg_POWER_NORMAL(void)
{  // 主电源正常
   Warn_Status[2] &= ~0x01;//BIT( 0 );     
   ModuleStatus&=~Status_Battery;
}

void StatusReg_GPS_A(void)
{     // GPS 定位 
   if(GPS_getfirst==0)
   {	    
	 #ifdef LCD_5inch
                   DwinLCD.Type=LCD_SETTIME;       
	  #endif
   }	  
 GPS_getfirst=1;
 Car_Status[3]|=0x02;   //Bit(1)
 ModuleStatus |= Status_GPS;	
}

void StatusReg_GPS_V(void) 
{    //  GPS 不定位      河北版本就填写 V 情况
  //  if(GPS_getfirst==1)
      // Car_Status[3]|=0x02;   //满足河北对数据有效性的要求  首次定位后，不定位的填写成定位 
  // else
      // Car_Status[3]&=~0x02;   //Bit(1)    // 河北special 

  ModuleStatus &= ~Status_GPS;
}
	
void StatusReg_SPD_WARN(void)
{    //  超速报警
   Warn_Status[3] |= 0x02;//BIT( 1 );
}

void StatusReg_SPD_NORMAL(void)
{    //  速度正常
  Warn_Status[3] &=~ 0x02;//BIT( 1 );
}

void StatusReg_Relay_Cut(void)
{  // 断油断电状态 

}

 void StatusReg_Relay_Normal(void)
{ //  断油电状态正常
 
}


void StatusReg_Default(void)
{    //   状态寄存器还原默认设置
   Warn_Status[0]=0x00; //HH
   Warn_Status[1]=0x00; //HL  
   Warn_Status[2]=0x00; //LH 
   Warn_Status[3]=0x00; //LL	      
}

//==================================================================================================
// 第三部分 :   以下是GPRS无线传输相关协议
//==================================================================================================
void  Save_GPS(void)     
{
   u16 counter_mainguffer,i;
   u8  lati_reg[4];//,regstatus;
   
		  if (PositionSD_Status())	
		  {
		         if(DF_LOCK==enable)    // 清除文件区域时 ，禁止操作DF
				 	return ;
			  if((ReadFail_sd_current)&&DataLink_Status())
			  	{      rt_kprintf("\r\n read fail don't save\r\n");   return;}
		     //1.   时间超前判断
                            //  if(Time_FastJudge()==false)    
					//		return ;		 
				  //----------------------- Save GPS --------------------------------------
				  memset(GPSsaveBuf,0,40);
				  GPSsaveBuf_Wr=0;				  
				   //------------------------------- Stuff ----------------------------------------
					counter_mainguffer = GPSsaveBuf_Wr;
				   // 1. 告警状态   4 Bytes
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )Warn_Status,4 );   
				   GPSsaveBuf_Wr += 4;  
                   // 2. 车辆状态   4 Bytes
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )Car_Status,4 );   
				   GPSsaveBuf_Wr += 4; 
				   // 3.   纬度     4 Bytes
				   memcpy(lati_reg,Gps_Gprs.Latitude,4);
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
				   GPSsaveBuf_Wr += 4;
				   // 4.   经度     4 Bytes
				   memcpy( ( char * ) GPSsaveBuf + GPSsaveBuf_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	 //经度    东经  Bit 7->0	西经 Bit 7 -> 1
				   GPSsaveBuf_Wr += 4;
				   // 5.  高度	  2 Bytes    m
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(GPS_Hight>>8);	// High 			   
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)GPS_Hight;  // Low  
				   // 6.  速度	  2 Bytes     0.1Km/h
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(Speed_gps>>8);	// High 			   
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)Speed_gps;  // Low 
				   // 7.  方向	  2 Bytes	    1度 				   
				   GPSsaveBuf[GPSsaveBuf_Wr++]=(GPS_direction>>8);	//High
				   GPSsaveBuf[GPSsaveBuf_Wr++]=GPS_direction; // Low				   
				   // 8.  日期时间	  6 Bytes 
				    GPSsaveBuf[GPSsaveBuf_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);  	   	
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
					GPSsaveBuf[GPSsaveBuf_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);    
                   //------------------------------------------------------------------ 
                   //   注:   因为长度有限所以存储时只存储传感器速度，不填写 类型和长度 
                  //----------- 附加信息  ------------
				    //  附加信息 1  -----------------------------    
					//	附加信息 ID
					//Original_info[Original_info_Wr++]=0x03; // 行驶记录仪的速度
					//	附加信息长度
					//Original_info[Original_info_Wr++]=2;
					//	类型
					GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)(Speed_cacu>>8);  
					GPSsaveBuf[GPSsaveBuf_Wr++]=(u8)(Speed_cacu);	           
                   //-------------  Caculate  FCS  -----------------------------------
					FCS_GPS_UDP=0;  
					for ( i = counter_mainguffer; i < 30; i++ )  
					{
							FCS_GPS_UDP ^= *( GPSsaveBuf + i ); 
					}			   //求上边数据的异或和
					GPSsaveBuf[30] = FCS_GPS_UDP;  	  


                           //----------------------------------------------------------------
			/*	  {
					     rt_kprintf("\r\n Before :\r\n ");   
						  for(i=0;i<31;i++)
						  	 rt_kprintf("%2X ",GPSsaveBuf[i]);   
						 rt_kprintf("\r\n"); 
				 }
			*/	 
			      //-------------------------------- Save  ------------------------------------------
			      if(Api_cycle_write(GPSsaveBuf,31))
			      { 
					  if(DispContent) 	
					       rt_kprintf("\r\n    GPS Save succed\r\n"); 
			      	}  
			      else
			       {
				  	  if(DispContent) 
				     	         rt_kprintf("\r\n GPS save fail\r\n"); 
					  
					  if( Api_cycle_write(GPSsaveBuf,31))
					  	   rt_kprintf("\r\n GPS save retry ok\r\n");  
				 } 
  
                           //---------------------------------------------------------------------------------
			    if(PositionSD_Status())
				         PositionSD_Disable();
				  //-----------------------------------------------------
		  }
   

