nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}
//----------------------------------------------------------------------
u8  Protocol_Head(u16 MSG_ID, u8 Packet_Type)
{
     u32    Reg_ID=0;
     //----  clear --------------
       Original_info_Wr=0;
	//	1. Head  
	
	    //  original info
	   Original_info[Original_info_Wr++]=(MSG_ID>>8); // 消息ID 
	   Original_info[Original_info_Wr++]=(u8)MSG_ID;
	   
	   Original_info[Original_info_Wr++]=0x00; // 分包、加密方式、状态位 
	   Original_info[Original_info_Wr++]=28; // 消息体长度   位置信息长度为28个字节
	   
	   memcpy(Original_info+Original_info_Wr,SIM_code,6); // 终端手机号 ，设备标识ID	BCD
	   Original_info_Wr+=6;  
	   


       if(Packet_Type==Packet_Divide) 
       	{
            switch (MediaObj.Media_Type)
	         {
	          case 0 : // 图像
	                              MediaObj.Media_totalPacketNum=Photo_sdState.Total_packetNum;  // 图片总包数
					  MediaObj.Media_currentPacketNum=Photo_sdState.SD_packetNum;  // 图片当前报数 
					  MediaObj.Media_ID=1;   //  多媒体ID
					  MediaObj.Media_Channel=Camera_Number;  // 图片摄像头通道号
					  
                                      Reg_ID=0xF000+Camera_Number*0x0100+Photo_sdState.SD_packetNum;
					   Original_info[Original_info_Wr++]=( Reg_ID>>8); //消息流水号
	                               Original_info[Original_info_Wr++]=  Reg_ID;				  
					  
			          break;
			  case 1 : // 音频
					  MediaObj.Media_totalPacketNum=Sound_sdState.Total_packetNum;	// 音频总包数
					  MediaObj.Media_currentPacketNum=Sound_sdState.SD_packetNum;  // 音频当前报数
					  MediaObj.Media_ID=1;	 //  多媒体ID
					  MediaObj.Media_Channel=1;  // 音频通道号   
					  
					  Reg_ID=0xE000+Sound_sdState.SD_packetNum;
					   Original_info[Original_info_Wr++]=( Reg_ID>>8); //消息流水号
	                               Original_info[Original_info_Wr++]=  Reg_ID;	

			          break;
			  case 2 : // 视频
					  MediaObj.Media_totalPacketNum=Video_sdState.Total_packetNum;	// 视频总包数
					  MediaObj.Media_currentPacketNum=Video_sdState.SD_packetNum;  // 视频当前报数
					  MediaObj.Media_ID=1;	 //  多媒体ID
					  MediaObj.Media_Channel=1;  // 视频通道号 
			          break;
			  default:
			  	      return false;
	         }
               //    当前包数
		 Original_info[Original_info_Wr++]=(MediaObj.Media_totalPacketNum&0xff00)>>8;//总block
		 Original_info[Original_info_Wr++]=(u8)MediaObj.Media_totalPacketNum;//总block
			 
		 //   总包数	 
	        Original_info[Original_info_Wr++]=((MediaObj.Media_currentPacketNum)&0xff00)>>8;//当前block
	        Original_info[Original_info_Wr++]=(u8)((MediaObj.Media_currentPacketNum)&0x00ff);//当前block

       	}  
            else
            	{
		     Original_info[Original_info_Wr++]=( JT808Conf_struct.Msg_Float_ID>>8); //消息流水号
	            Original_info[Original_info_Wr++]= JT808Conf_struct.Msg_Float_ID;		
            	}

			
	    return true;

}  

void Protocol_End(u8 Packet_Type,u8 LinkNum)   
{                   
 u16 packet_len=0;  
 u16  i=0;		//要发送的UDP 数据内容的长度
 u8   Gfcs=0;
 u16   Msg_bodyLen=0; //  协议里的消息只表示消息体     不包含消息头 消息头默认长度是12 , 分包消息头长度 20   
 
   Gfcs=0;				   //  计算从消息头开始到校验前数据的异或和  808协议校验  1Byte
   //---  填写信息长度 ---
   if(Packet_Normal==Packet_Type)
   {
     Msg_bodyLen=Original_info_Wr-12;
     Original_info[2]=(Msg_bodyLen>>8) ;
     Original_info[3]=Msg_bodyLen;
   }
   else
    if(Packet_Divide==Packet_Type)
   {
     Msg_bodyLen=Original_info_Wr-16;
	// rt_kprintf("\r\n Divide Infolen=%d  \r\n",Msg_bodyLen);  
     Original_info[2]=(Msg_bodyLen>>8)|0x20 ;  // Bit 13  0x20 就是Bit 13
     Original_info[3]=Msg_bodyLen;  
   }
   //---- 计算校验  -----
   for(i=0;i<Original_info_Wr;i++)  
		Gfcs^=Original_info[i]; 
   Original_info[Original_info_Wr++]=Gfcs;  // 填写G校验位     


  // 1.stuff start
   GPRS_infoWr_Tx=0;	
   GPRS_info[GPRS_infoWr_Tx++]=0x7e;   // Start 标识位
    if(Packet_Divide==Packet_Type)
   {   
       //rt_kprintf("\r\n Tx=%d  Divide Infolen=%d  \r\n",GPRS_infoWr_Tx,Original_info_Wr);   
	  /* rt_kprintf("\r\n PacketContent: ");
				   for(i=0;i<Original_info_Wr;i++)
                       rt_kprintf(" %X",Original_info[i]);    
				   rt_kprintf("\r\n");
	  */
   }
  // 2.  convert 
   packet_len=Protocol_808_Encode(GPRS_info+GPRS_infoWr_Tx,Original_info,Original_info_Wr);
   GPRS_infoWr_Tx+=packet_len;	   
    if(Packet_Divide==Packet_Type)
   {
	 //rt_kprintf("\r\n Divide  Send Infolen=%d  \r\n",packet_len);  
	 
	/* rt_kprintf("\r\n EncodeContent: ");
	 for(i=0;i<packet_len;i++)
                       rt_kprintf(" %X",GPRS_info[i+1]);      
	rt_kprintf("\r\n"); 
	*/
	//rt_kprintf("\r\n GPRStx  Send Infolen=%d  \r\n",GPRS_infoWr_Tx+1);    
   }
   GPRS_info[GPRS_infoWr_Tx++]=0x7e;  //  End  标识
  //  4. Send   

    // 4.1 发送信息内容1
     if(DispContent==2)
	 {
	    rt_kprintf("\r\n App to GSM info:");    
	    for(i=0;i<GPRS_infoWr_Tx;i++)
			 rt_kprintf(" %02X",GPRS_info[i]);  
		rt_kprintf("\r\n"); 
	 }
    // 4.2   MsgQueue
    WatchDog_Feed();
   Gsm_rxAppData_SemRelease(GPRS_info,GPRS_infoWr_Tx,LinkNum);  
   //--------消息序号 递增 --------
   JT808Conf_struct.Msg_Float_ID++;   
  //------------------------------ 
} 
//--------------------------------------------------------------------------------------
u8  Stuff_DevCommmonACK_0001H(void)      
{    
	// 1. Head
	  if(!Protocol_Head(MSG_0x0001,Packet_Normal))  return false;     //终端通用应答
	 // 2. content  is null 
	   //   float ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID;
	    //  cmd  ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_CmdID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_CmdID;   
		//   resualt
	    Original_info[Original_info_Wr++]=SD_ACKflag.f_CentreCMDack_resualt;
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	      rt_kprintf("\r\n	Common CMD ACK! \r\n");  
	 return true;    
}


//-------------------------------------------------------------------------
u8  Stuff_RegisterPacket_0100H(u8  LinkNum)  
{  
  
// 1. Head
  if(!Protocol_Head(MSG_0x0100,Packet_Normal)) 
 	return false; 	
    
 // 2. content 
    //  province ID
    Original_info[Original_info_Wr++]=(u8)(JT808Conf_struct.Vechicle_Info.Dev_ProvinceID>>8);
    Original_info[Original_info_Wr++]=(u8)JT808Conf_struct.Vechicle_Info.Dev_ProvinceID;
    //  county  ID
    Original_info[Original_info_Wr++]=(u8)(JT808Conf_struct.Vechicle_Info.Dev_CityID>>8);
    Original_info[Original_info_Wr++]=(u8)JT808Conf_struct.Vechicle_Info.Dev_CityID;   
	//  product Name	
    memcpy(Original_info+Original_info_Wr,"TCBBD",5);
    Original_info_Wr+=5;
	//  终端型号 20 Bytes      -- 补充协议里做更改
	memcpy(Original_info+Original_info_Wr,"Tianjin TCB TW701-BD",20);  
    Original_info_Wr+=20;      
    //  终端ID   7 Bytes    ,    
    memcpy(Original_info+Original_info_Wr,DeviceNumberID+5,7);   
    Original_info_Wr+=7;  
	//  车牌颜色  
	Original_info[Original_info_Wr++]=JT808Conf_struct.Vechicle_Info.Dev_Color;
	//  车牌
	memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_Num,13);  
	Original_info_Wr+=13;

 
 //  3. Send 
  Protocol_End(Packet_Normal,LinkNum);   
  if(DispContent)
 rt_kprintf("\r\n	SEND Reigster Packet! \r\n");  
 return true;  

