nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
    }

    
	   //  附加信息 5  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0xFE; //信号强度
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=2; 
	 //  类型
	 Original_info[Original_info_Wr++]= BD_EXT.FJ_SignalValue; 
	 Original_info[Original_info_Wr++]=0x00;  //  保留 

        //if(DispContent)
         //     rt_kprintf("\r\n---- Satelitenum: %d , CSQ:%d\r\n",Satelite_num,ModuleSQ);  

        //  附加信息 6  -----------------------------	  
	 //  附加信息 ID
	 Original_info[Original_info_Wr++]=0xFF; //自定义模拟量上传
	 //  附加信息长度
	 Original_info[Original_info_Wr++]=6; 
	 //  类型
	 Original_info[Original_info_Wr++]= BD_EXT.FJ_IO_1; 
	 Original_info[Original_info_Wr++]= BD_EXT.FJ_IO_2;  
	 Original_info[Original_info_Wr++]=(BD_EXT.AD_0>>8);  // 模拟量 1
	 Original_info[Original_info_Wr++]=BD_EXT.AD_0;
	 Original_info[Original_info_Wr++]=(BD_EXT.AD_1>>8);  // 模拟量 2
	 Original_info[Original_info_Wr++]=BD_EXT.AD_1;
	
 //  3. Send 
Protocol_End(Packet_Normal ,0);
 if(DispContent)
   rt_kprintf("\r\n	SEND GPS CMD=81H ! \r\n"); 
   	
 return true; 

}


//-----------------------------------------------------------------------
u8  Stuff_SettingPram_0104H(void)
{
   u8  reg_str[30];
  
  //  1. Head     
  if(!Protocol_Head(MSG_0x0104,Packet_Normal)) 
 	  return false; // 终端参数上传

  //  2. content 
       //   float ID
	    Original_info[Original_info_Wr++]=(u8)(Centre_FloatID>>8);
	    Original_info[Original_info_Wr++]=(u8)Centre_FloatID;
	   //   参数个数	
	    Original_info[Original_info_Wr++]=11;
	   //   参数列表

	   //   2.1   车牌号
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x83;
		Original_info[Original_info_Wr++]=strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num); // 参数长度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )JT808Conf_struct.Vechicle_Info.Vech_Num,strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num) ); // 参数值
		Original_info_Wr+=strlen((const char*)JT808Conf_struct.Vechicle_Info.Vech_Num); 
        
		//   2.2  主服务器IP    
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x13;    
		                                         // 参数长度		

	   memset(reg_str,0,sizeof(reg_str));     //  填写域名
	   memcpy(reg_str,DomainNameStr,strlen((char const*)DomainNameStr));
	   Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
          memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));  // 参数值	 
	   Original_info_Wr+=strlen((const char*)reg_str);

         //==================												 
	 /*   memset(reg_str,0,sizeof(reg_str));
	    IP_Str((char*)reg_str, *( u32 * ) RemoteIP_main);   
		Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));  // 参数值	 
		Original_info_Wr+=strlen((const char*)reg_str);
	*/

		//   2.3   主服务TCP端口
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x18;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=0x00;   // 参数值
		Original_info[Original_info_Wr++]=0x00; 
		Original_info[Original_info_Wr++]=(RemotePort_main>>8); 
		Original_info[Original_info_Wr++]=RemotePort_main; 
													    
		 //   2.4  APN 字符串
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x10;
		Original_info[Original_info_Wr++]=strlen((const char*)APN_String); // 参数长度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )APN_String,strlen((const char*)APN_String)); // 参数值
		Original_info_Wr+=strlen((const char*)APN_String);

        //  2.5   备用IP		 
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x17;    
		                                         // 参数长度		 	    
		memset(reg_str,0,sizeof(reg_str));
	    IP_Str((char*)reg_str, *( u32 * ) RemoteIP_aux);
		Original_info[Original_info_Wr++]=strlen((const char*)reg_str);
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )reg_str,strlen((const char*)reg_str));  // 参数值	 
		Original_info_Wr+=strlen((const char*)reg_str);
		
          
		 //   2.6   缺省时间上报间隔
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x29;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>24);   // 参数值 
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>16);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur>>8);
		Original_info[Original_info_Wr++]=(JT808Conf_struct.DURATION.Default_Dur);     
		
		 //   2.7   中心监控号码
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x40;
		Original_info[Original_info_Wr++]=strlen((const char*)JT808Conf_struct.LISTEN_Num); // 参数长度
		memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )JT808Conf_struct.LISTEN_Num,strlen((const char*)JT808Conf_struct.LISTEN_Num)); // 参数值
		Original_info_Wr+=strlen((const char*)JT808Conf_struct.LISTEN_Num);
		 //   2.8   最大速度门限
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x55;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>24);   // 参数值
		Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>16);  
		Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX>>8);
		Original_info[Original_info_Wr++]=( JT808Conf_struct.Speed_warn_MAX);
		 //   2.9   连续驾驶门限
        Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
        Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x00;
		Original_info[Original_info_Wr++]=0x57;
		Original_info[Original_info_Wr++]=4  ; // 参数长度
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>24);   // 参数值
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>16);  
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec>>8);
		Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_DrvKeepingSec);
		 //   2.10   最小休息时间
		 Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0x59;
		 Original_info[Original_info_Wr++]=4  ; // 参数长度
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>24);	 // 参数值
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>16);	
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec>>8);
		 Original_info[Original_info_Wr++]=(TiredConf_struct.TiredDoor.Door_MinSleepSec);         
		 //  2.11  终端ID 号码
               Original_info[Original_info_Wr++]=0x00;   // 参数ID 4Bytes
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=0xF0;
		 Original_info[Original_info_Wr++]=0x00;
		 Original_info[Original_info_Wr++]=12  ; // 参数长度
		  // 参数值
		 memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )DeviceNumberID,12); // 参数值
		 Original_info_Wr+=12;      
		 
		 
  //  3. Send 
  Protocol_End(Packet_Normal ,0);
  if(DispContent)
	rt_kprintf("\r\n	发送参数查询信息! \r\n");    

