nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
  return true;
}
//--------------------------------------------------------------------------
u8  Stuff_EventACK_0301H(void)      
{    
	// 1. Head
	if(!Protocol_Head(MSG_0x0301,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	   Original_info[Original_info_Wr++]=EventObj.Event_ID;// 返回事件ID
	    
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	 事件结果返回  \r\n");    
	 return true; 

}

u8  Stuff_ASKACK_0302H(void)      
{  
  
	// 1. Head
	if(!Protocol_Head(MSG_0x0302,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	   //  应答流水号
	   Original_info[Original_info_Wr++]=(ASK_Centre.ASK_floatID>>8);// 返回事件ID
	   Original_info[Original_info_Wr++]=ASK_Centre.ASK_floatID;
       Original_info[Original_info_Wr++]=ASK_Centre.ASK_answerID;	    
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	发送提问选择结果 \r\n");     
	 return true; 

}

u8  Stuff_MSGACK_0303H(void)      
{  
 
	// 1. Head
	if(!Protocol_Head(MSG_0x0303,Packet_Normal)) 
 	  return false; 
	 // 2. content   
	   //  应答流水号
	   Original_info[Original_info_Wr++]=MSG_BroadCast_Obj.INFO_TYPE; 
	   Original_info[Original_info_Wr++]=MSG_BroadCast_Obj.INFO_PlyCancel;  //  0  取消  1 点播 
	 //  3. Send 
	 Protocol_End(Packet_Normal ,0);
	  if(DispContent)
	 rt_kprintf("\r\n	点播取消回复  \r\n");     
	 return true;    

}

u8  Stuff_ControlACK_0500H(void)   //   车辆控制应答
{  

 //  1. Head	
   if(!Protocol_Head(MSG_0x0500,Packet_Normal)) 
 	  return false; 
 // 2. content 
    //------------------------------- Stuff ----------------------------------------
    //   float ID                                                // 对应中心应答消息的流水号
	Original_info[Original_info_Wr++]=(u8)(Vech_Control.CMD_FloatID>>8);
	Original_info[Original_info_Wr++]=(u8)Vech_Control.CMD_FloatID;  

	// 1. 告警标志  4
	memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Warn_Status,4 );    
	Original_info_Wr += 4;
	// 2. 状态  4
	memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )Car_Status,4 );   
	Original_info_Wr += 4;
	// 3.  纬度
    memcpy( ( char * ) Original_info+ Original_info_Wr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
	Original_info_Wr += 4;
	// 4.  经度
	memcpy( ( char * ) Original_info+ Original_info_Wr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Original_info_Wr += 4;
	// 5.  高程
	Original_info[Original_info_Wr++]=(u8)(GPS_Hight<<8);
	Original_info[Original_info_Wr++]=(u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Original_info[Original_info_Wr++]=(u8)(Speed_gps>>8);
	Original_info[Original_info_Wr++]=(u8)Speed_gps;   
	// 7. 方向   单位 1度
	Original_info[Original_info_Wr++]=(GPS_direction>>8);  //High 
	Original_info[Original_info_Wr++]=GPS_direction; // Low
	// 8.  日期时间	
	Original_info[Original_info_Wr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
	Original_info[Original_info_Wr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
	Original_info[Original_info_Wr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
	Original_info[Original_info_Wr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
	Original_info[Original_info_Wr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
	Original_info[Original_info_Wr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	 

 //  3. Send 
 Protocol_End(Packet_Normal ,0);
 if(DispContent)
   rt_kprintf("\r\n	SEND  Vech  Control  ! \r\n"); 
   	
 return true; 

}

u8  Stuff_RecoderACK_0700H(void)   //   行车记录仪数据上传
{  

   u16	SregLen=0,Swr=0;//,Gwr=0; // S:serial  G: GPRS   
   u8	       Sfcs=0;     
   u16	i=0;   
   u32	regdis=0,reg2=0;   
   u8   	Reg[70];  
   u8       QueryRecNum=0;  // 查询记录数目

 //  1. Head	
 if(!Protocol_Head(MSG_0x0700,Packet_Normal)) 
 	  return false; 
 // 2. content 
    //------------------------------- Stuff ----------------------------------------
    //   float ID                                                // 对应中心应答消息的流水号
	Original_info[Original_info_Wr++]=(u8)(Recode_Obj.Float_ID>>8);
	Original_info[Original_info_Wr++]=(u8)Recode_Obj.Float_ID;  
	//   命令字
	Original_info[Original_info_Wr++]=Recode_Obj.CMD;   // 命令字  

    //   记录仪 数据块
	//---------------填写 A 协议头 ------------------------
	Swr=Original_info_Wr;	// reg save 
	Original_info[Original_info_Wr++]=0x55;  // 起始头
	Original_info[Original_info_Wr++]=0x7A; 
	//---------------根据类型分类填写内容------------------
	switch(Recode_Obj.CMD)  
	  {
		  //---------------- 上传数类型  -------------------------------------
		  case	A_Up_DrvInfo  : 	 //  当前驾驶员代码及对应的机动车驾驶证号
							   Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
	
							   SregLen=0x00;		   // 信息长度
							   Original_info[Original_info_Wr++]=0x00;    // Hi
							   Original_info[Original_info_Wr++]=21;	   // Lo
							   
							   Original_info[Original_info_Wr++]=0x00;    // 保留字 
							   
							   
							   memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.DriveCode,3);  
							   Original_info_Wr+=3;							   
							   memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.DriverCard_ID,18); //信息内容
							   Original_info_Wr+=18;  
							   break;
		  case	A_Up_RTC	  : 	 //  采集记录仪的实时时钟
							  Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
	
							   SregLen=0x00;		   // 信息长度
							   Original_info[Original_info_Wr++]=0x00;    // Hi
							   Original_info[Original_info_Wr++]=6;	  // Lo
							   
							   Original_info[Original_info_Wr++]=0x00;    // 保留字
							   
							   Time2BCD(Original_info+Original_info_Wr);	//信息内容	
							   Original_info_Wr+=6;
							   break;
		  case	A_Up_Dist	  :    //  采集360h内里程
							   Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
	
							   SregLen=0x00;		   // 信息长度
							   Original_info[Original_info_Wr++]=0x00;    // Hi
							   Original_info[Original_info_Wr++]=8;	   // Lo
							   
							   Original_info[Original_info_Wr++]=0x00;    // 保留字
							   //	信息内容
							    // -- 里程 3个字节 单位0.1km    6位
							   regdis=JT808Conf_struct.Distance_m_u32/100;  //单位0.1km 
							   reg2=regdis/100000;
							  Original_info[Original_info_Wr++]=(reg2<<4)+(regdis%100000/10000);
							  Original_info[Original_info_Wr++]=((regdis%10000/1000)<<4)+(regdis%1000/100);
							  Original_info[Original_info_Wr++]=((regdis%100/10)<<4)+(regdis%10);   
							    //  --读出里程时的RTC --- 
							  Time2BCD(Original_info+Original_info_Wr);	//信息内容	
							  Original_info_Wr+=5;   // 只要求到分 所以是 5个字节
							  break; 
	
		  case	A_Up_PLUS	  :    //  采集记录仪特征系数
							   Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
	
