nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
							   SregLen=0x00;		   // 信息长度
							   Original_info[Original_info_Wr++]=0x00;    // Hi
							   Original_info[Original_info_Wr++]=3;	   // Lo
							   
							   Original_info[Original_info_Wr++]=0x00;    // 保留字
	
							   //  信息内容
							   Original_info[Original_info_Wr++]=(u8)(JT808Conf_struct.Vech_Character_Value>>16);
							   Original_info[Original_info_Wr++]=(u8)(JT808Conf_struct.Vech_Character_Value>>8); 
							   Original_info[Original_info_Wr++]=(u8)(JT808Conf_struct.Vech_Character_Value);  
							   
							   break;
		  case	A_Up_VechInfo :    //  车辆信息
							   Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
	
							   SregLen=0x00;		   // 信息长度
							   Original_info[Original_info_Wr++]=0x00;    // Hi
							   Original_info[Original_info_Wr++]=41;	   // Lo
							   
							   Original_info[Original_info_Wr++]=0x00;    // 保留字							  
							   
							   memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_VIN,17); //信息内容
							   Original_info_Wr+=17;
							   memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_Num,12);
							   Original_info_Wr+=12;
							   memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Vechicle_Info.Vech_Type,12);	
							   Original_info_Wr+=12; 
	
							   break;
	      case	A_Up_Doubt	  :    //  事故疑点数据
						     Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
  
							 SregLen=206;		 // 信息长度
							 Original_info[Original_info_Wr++]=(u8)(SregLen>>8);	 // Hi
							 Original_info[Original_info_Wr++]=(u8)SregLen;		 // Lo		 
							 
							 Original_info[Original_info_Wr++]=0x00;	 // 保留字		
							 //------- 信息内容 ------		
							 if(Api_DFdirectory_Read(doubt_data, Original_info+Original_info_Wr,207,0,0)==1)
							 	  Original_info_Wr+=206; //	 内容是206
							 else
							 {  //该填写长度
				                                   Original_info[Original_info_Wr-3]=0x00;//Hi
				                                   Original_info[Original_info_Wr-2]=0x00;//lo
							 } 
	
							   break;							   
		  case	A_Up_N2daysDist:    //  最近2 天累计行驶里程
							   Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
	
							   SregLen=0x00;		   // 信息长度
							   Original_info[Original_info_Wr++]=0x00;    // Hi
							   Original_info[Original_info_Wr++]=8;	   // Lo
							   
							   Original_info[Original_info_Wr++]=0x00;    // 保留字
							   //	信息内容
							    // -- 里程 3个字节 单位0.1km    6位
							   regdis=(JT808Conf_struct.Distance_m_u32-JT808Conf_struct.DayStartDistance_32)/100;  //单位0.1km 
							   reg2=regdis/100000;
							   Original_info[Original_info_Wr++]=(reg2<<4)+(regdis%100000/10000);
							   Original_info[Original_info_Wr++]=((regdis%10000/1000)<<4)+(regdis%1000/100);
							   Original_info[Original_info_Wr++]=((regdis%100/10)<<4)+(regdis%10);   
							    //  --读出里程时的RTC --- 
							  Time2BCD(Original_info+Original_info_Wr);	//信息内容	
							  Original_info_Wr+=5;   // 只要求到分 所以是 5个字节
							  // Original_info_Wr+=18;		   //  18字节内不足填写00H
							   break; 
	      case  A_Up_N2daysSpd:	  // 最近2天内的行驶速度   7小时
									  Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
		   
									  SregLen=455;		  // 信息长度
									  Original_info[Original_info_Wr++]=(u8)(SregLen>>8);	  // Hi
									  Original_info[Original_info_Wr++]=(u8)SregLen;	  // Lo    65x7    
									  
									  Original_info[Original_info_Wr++]=0x00;	  // 保留字 	
									  //-----------  信息内容  --------------		
                                                                   //----------------------
										  QueryRecNum=Api_DFdirectory_Query(spdpermin,0);   //查询当前疲劳驾驶记录数目
										 if(QueryRecNum>7)								   
										        QueryRecNum=7;			
								
										    SregLen=QueryRecNum*65;
										      // 改写信息长度
			                                                      Original_info[Original_info_Wr-3]=(u8)(SregLen>>8);	  // Hi
			                                                      Original_info[Original_info_Wr-2]=(u8)SregLen;	  // Lo    65x7    
										 for(i=0;i<QueryRecNum;i++)			   // 从最新处读取存储填写
										  {
											 Api_DFdirectory_Read(spdpermin,Reg,70,0,i); // 从new-->old  读取
											  memcpy(Original_info+Original_info_Wr,Reg+5,60);	// 只填写速度
											Original_info_Wr+=65;	    
										  }
									       //------------------------------
									  
							break; 

		  case	A_Up_AvrgMin  : 	 //  360h 对应每分钟的平均速度	 // 默认填写最新7hour记录 
										 Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
			  
										 SregLen=435;		 // 信息长度 
										 Original_info[Original_info_Wr++]=(u8)(SregLen>>8);	 // Hi
										 Original_info[Original_info_Wr++]=(u8)SregLen;		 // Lo	  65x7	  
										 
										 Original_info[Original_info_Wr++]=0x00;	 // 保留字	   
										 //-----------	信息内容  --------------	
                                                                                  //----------------------
										  QueryRecNum=Api_DFdirectory_Query(spdpermin,0);   //查询当前疲劳驾驶记录数目
										 if(QueryRecNum>7)								   
										        QueryRecNum=7;			
								
										    SregLen=QueryRecNum*65;     // 改写信息长度
			                                                      Original_info[Original_info_Wr-3]=(u8)(SregLen>>8);	  // Hi
			                                                      Original_info[Original_info_Wr-2]=(u8)SregLen;	  // Lo    65x7    

																  
										 for(i=0;i<QueryRecNum;i++)			   // 从最新处读取存储填写
										  {
											 Api_DFdirectory_Read(spdpermin,Reg,70,1,i); // 从new-->old  读取
											  memcpy(Original_info+Original_info_Wr,Reg+5,60);	// 只填写速度
											Original_info_Wr+=65;	    
										  }
									       //------------------------------
										 
							   break; 
	
		  case	A_Up_Tired	  : 	//	疲劳驾驶记录
										 Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
			  
										 SregLen=90;		 // 信息长度
										 Original_info[Original_info_Wr++]=(u8)(SregLen>>8);	 // Hi
										 Original_info[Original_info_Wr++]=(u8)SregLen;		 // Lo	  30x6	 
										 
										 Original_info[Original_info_Wr++]=0x00;	 // 保留字		 
										 //------------ 
										 memcpy(Original_info+Original_info_Wr,JT808Conf_struct.Driver_Info.DriverCard_ID,18); //机动车驾驶证号
							                      Original_info_Wr+=18;  
										 QueryRecNum=Api_DFdirectory_Query(tired_warn,0);   //查询当前疲劳驾驶记录数目
										 if(QueryRecNum>6)								   
										        QueryRecNum=6;		
										 
										    SregLen=QueryRecNum*12+18;     // 改写信息长度
			                                                      Original_info[Original_info_Wr-3]=(u8)(SregLen>>8);	  // Hi
			                                                      Original_info[Original_info_Wr-2]=(u8)SregLen;	  // Lo    65x7    

										 
										 for(i=0;i<QueryRecNum;i++)			   // 从最新处读取存储填写
										  {
											 Api_DFdirectory_Read(tired_warn,Reg,31,0,i); // 从new-->old  读取
											  memcpy(Original_info+Original_info_Wr,Reg+18,12);	//只要起始时间
											  Original_info_Wr+=12;	     
										  }
	
							   break; 
		  //------------------------ 下传数据相关命令 ---------------------
		  case	A_Dn_DrvInfo  : 	  //  设置 驾驶员信息
		  case  A_Dn_VehicleInfo:     //  设置车辆信息							 
		  case	A_Dn_RTC	  : 	   //  设置记录仪时间
		  case	A_Dn_Plus	  : 	   //  设置速度脉冲系数
							   
						  //   JT808Conf_struct.Vech_Character_Value=((u32)(*InStr)<<24)+((u32)(*InStr+1)<<16)+((u32)(*InStr+2)<<8)+(u32)(*InStr+3); // 特征系数   速度脉冲系数
						  //   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
							   //-------------------------------------------------------------	
							   Original_info[Original_info_Wr++]=Recode_Obj.CMD; //命令字
												  // 信息长度
							   Original_info[Original_info_Wr++]=0x00;    // Hi
							   Original_info[Original_info_Wr++]=0;	  // Lo   20x8							   
							   Original_info[Original_info_Wr++]=0x00;    // 保留字   
							   break;
		  default :
							 //  rt_kprintf("Error:	Device Type Error! \r\n");
							   return  false; 
							   
