nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}
//------------------------------------------------------------------------------------
u8 Stuff_DataTrans_0900_ISP_ACK(u8  AckType)
{  
  u16  TX_NUM=0,Rec_Num=0,i=0;	 
  u8   Gfcs=0;
  //---------------------------------------------
   // 1. Head
   if(!Protocol_Head(MSG_0x0900,Packet_Normal)) 
	 return false; 
	// 2. content	
	//	应答流水号
   Original_info[Original_info_Wr++]=1;// 返回透传数据的类型 1	表示远程下载
	// 3. 内容
		//	3.1. Sub Head  
		   Rec_Num=Original_info_Wr; //reglen 
			memcpy(Original_info+Original_info_Wr,"*GB",3); // GPRS 起始头
		   Original_info_Wr+=3;
		   
		   Original_info[Original_info_Wr++]=0x00;	// SIM 号码   最先两个字节填写0x00
		   Original_info[Original_info_Wr++]=0x00;
		   memcpy(Original_info+Original_info_Wr,SIM_code,6);
		   Original_info_Wr+=6;  
  
		   Original_info_Wr+=2;   // 长度增加两个字节，但内容随后填写
		   
		   Original_info[Original_info_Wr++]=0x00; //消息序号 默认 0x00
		 // 3.2 Sub Info			 
			 Original_info[Original_info_Wr-1]=0x01; //消息序号 默认 0x00
			 Original_info[Original_info_Wr++]=0x30; //参数 	必须应答
			 
			 Original_info[Original_info_Wr++]=AckType; // 命令字	

			 switch(AckType)
			 	{
                  case  ISPACK_92:
				  case  ISPoverACK_96:    // 内容为空
				  	               break;
                  case  ISPinfoACK_94:                        
								Original_info[Original_info_Wr++]=(u8)(ISP_current_packnum>>8); // 当前包数
								Original_info[Original_info_Wr++]=(u8)ISP_current_packnum;
								Original_info[Original_info_Wr++]=(u8)(ISP_total_packnum>>8); // 总包数
								Original_info[Original_info_Wr++]=(u8)ISP_total_packnum;
								Original_info[Original_info_Wr++]=ISP_ack_resualt;	// 返回的状态	 
					               break;
                  default:
				  	      return false;
			 	}
  
		 // 3.3 Sub end
			 TX_NUM=Original_info_Wr-Rec_Num; // 子协议的长度
				//----stuff Ginfolen ---- 
			 Original_info[Rec_Num+11]=(u8)((TX_NUM-2)>>8);  // 长度不算头 
			 Original_info[Rec_Num+12]=(u8)(TX_NUM-2); 
			 //rt_kprintf("\r\n   测试	A=%X B=%X	reg=%d Reg=%d  REg=%d \r\n",GPRS_info[11],GPRS_info[12],reg,(u8)(reg<<8),reg&0x00ff);
			
			  Gfcs=0;				  //  计算从电话号码开始到校验前数据的异或和  G 协议校验 
			  for(i=3;i<Original_info_Wr;i++)
				   Gfcs^=Original_info[i]; 
			  Original_info[Original_info_Wr++]=Gfcs;  // 填写G校验位
			
			   
			  Original_info[Original_info_Wr++]=0x0D;  // G 协议尾	
			  Original_info[Original_info_Wr++]=0x0A;						 
	
	//	3. Send 
    Protocol_End(Packet_Normal,1 ); 
   if(DispContent)
   	{
      		 switch(AckType)
			 	{
                  case  ISPACK_92:
				  	              rt_kprintf("\r\n	 发送透传  ISP ID=%2X  ACK \r\n",ISPACK_92);       
				  	               break;
				  case  ISPoverACK_96:    // 内容为空
				                  rt_kprintf("\r\n	 发送透传 ISP ID=%2X  overACK \r\n",ISPoverACK_96); 
				  	               break;
                  case  ISPinfoACK_94:
					              // rt_kprintf("\r\nISP info ACK   current=%d ,totalnum=%d \r\n",ISP_current_packnum,ISP_total_packnum);		
					               break; 
                  default:
				  	      return false;
			 	}
 
   	}
   
   return true; 


}

//----------------------------------------------
u8  Update_HardSoft_Version_Judge(u8 * instr)
{
     //   读取第50 页信息
     	  Device_type=((u32)instr[1]<<24)+((u32)instr[2]<<16)+((u32)instr[3]<<8)+(u32)instr[4];
	  Firmware_ver=((u32)instr[5]<<24)+((u32)instr[6]<<16)+((u32)instr[7]<<8)+(u32)instr[8];
	  rt_kprintf("	\r\n 设备类型: %x  软件版本:%x \r\n",Device_type,Firmware_ver); 
	 
	 if(Device_type!=STM32F407_Recoder_32MbitDF)   
	  { 
		 rt_kprintf( "\r\n 设备类型不匹配不予更新" );
		 return false;
	  }  		   
        else
		  return true;


}




 //-------------------- ISP Check  ---------------------------------------------
void  ISP_file_Check(void)
{
   
         memset(ISP_buffer,0,sizeof(ISP_buffer));
	  ISP_Read(ISP_APP_Addr,ISP_buffer,PageSIZE);
	  /*
		   序号   字节数	名称			  备注
		  1 		  1    更新标志 	 1 表示需要更新   0 表示不需要更新
		  2-5			  4   设备类型				 0x0000 0001  ST712   TWA1
											0x0000 0002   STM32  103  新A1
											0x0000 0003   STM32  101  简易型
											0x0000 0004   STM32  A3  sst25
											0x0000 0005   STM32  行车记录仪 
		  6-9		 4	   软件版本 	 每个设备类型从  0x0000 00001 开始根据版本依次递增
		  10-29 	  20	日期		' mm-dd-yyyy HH:MM:SS'
		  30-31 	  2    总页数		   不包括信息页
		  32-35 	  4    程序入口地址    
		  36-200	   165	  预留	  
		  201-		  n    文件名  
	 
	  */
	  //------------   Type check  ---------------------
	  Device_type=((u32)ISP_buffer[1]<<24)+((u32)ISP_buffer[2]<<16)+((u32)ISP_buffer[3]<<8)+(u32)ISP_buffer[4];
	  Firmware_ver=((u32)ISP_buffer[5]<<24)+((u32)ISP_buffer[6]<<16)+((u32)ISP_buffer[7]<<8)+(u32)ISP_buffer[8];
	  rt_kprintf("	\r\n 设备类型: %x  软件版本:%x \r\n",Device_type,Firmware_ver); 
	 
	 if(Device_type!=STM32F407_Recoder_32MbitDF)   
	  { 
		 rt_kprintf( "\r\n 设备类型不匹配不予更新" );
		 ISP_buffer[0]=0;	 // 不更新下载的程序
		  ISP_Write(ISP_APP_Addr,ISP_buffer,PageSIZE); 
	  }  		   
	 	 
	  rt_kprintf( "\r\n 文件日期: " );					  
	  rt_kprintf("%20s",(const char*)(ISP_buffer+10));	 
	  rt_kprintf( "\r\n");	
	  rt_kprintf( "\r\n 文件名: " );
	  rt_kprintf("%100s",(const char*)(ISP_buffer+201));      
	  rt_kprintf( "\r\n");	
	 if(Device_type==STM32F407_Recoder_32MbitDF)         
	 {
		Systerm_Reset_counter= (Max_SystemCounter-5);	 // 准备重启更新最新程序
		ISP_resetFlag=1;//准备重启 
		rt_kprintf( "\r\n 准备重启更新程序!\r\n" );	 
	 }	 
   
 }



//----------------------------------------------------------------------------------
void Stuff_O200_Info_Only( u8* Instr) 
{
   u8  Infowr=0;
   
	// 1. 告警标志  4
	memcpy( ( char * ) Instr+ Infowr, ( char * )Warn_Status,4 );    
	Infowr += 4;
	// 2. 状态  4
	memcpy( ( char * ) Instr+ Infowr, ( char * )Car_Status,4 );   
	Infowr += 4;
	// 3.  纬度
    memcpy( ( char * ) Instr+ Infowr,( char * )  Gps_Gprs.Latitude, 4 );//纬度   modify by nathan
	Infowr += 4;
	// 4.  经度
	memcpy( ( char * ) Instr+ Infowr, ( char * )  Gps_Gprs.Longitude, 4 );	  //经度    东经  Bit 7->0   西经 Bit 7 -> 1
	Infowr += 4;
	// 5.  高程
	Instr[Infowr++]=(u8)(GPS_Hight<<8);
	Instr[Infowr++]=(u8)GPS_Hight;
	// 6.  速度    0.1 Km/h
	Instr[Infowr++]=(u8)(Speed_gps>>8);
	Instr[Infowr++]=(u8)Speed_gps;   
	// 7. 方向   单位 1度
	Instr[Infowr++]=(GPS_direction>>8);  //High 
	Instr[Infowr++]=GPS_direction; // Low
	// 8.  日期时间	
	Instr[Infowr++]=(((Gps_Gprs.Date[0])/10)<<4)+((Gps_Gprs.Date[0])%10);		
	Instr[Infowr++]=((Gps_Gprs.Date[1]/10)<<4)+(Gps_Gprs.Date[1]%10); 
	Instr[Infowr++]=((Gps_Gprs.Date[2]/10)<<4)+(Gps_Gprs.Date[2]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[0]/10)<<4)+(Gps_Gprs.Time[0]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[1]/10)<<4)+(Gps_Gprs.Time[1]%10);
	Instr[Infowr++]=((Gps_Gprs.Time[2]/10)<<4)+(Gps_Gprs.Time[2]%10);	

