nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
    return true;
}
//--------------------------------------------------------------------
u8  CentreSet_subService_8105H(u32 Control_ID, u8 infolen, u8 *Content )
{

   switch(Control_ID) 
   {
      case 1:  //  无线升级参数  参数之间采用分号分隔   指令格式如下:
             /*
URL 地址；拨号名称；拨号用户名；拨号密码；地址；TCP端口；UDP端口；制造商ID; 硬件版本；固件版本；连接到指定服务器指定是服务器时限；
           若某个参数无数值，则放空
               */
             rt_kprintf("\r\n 无线升级 \r\n");  
			 rt_kprintf("\r\n 内容: %s\r\n",Content); 
		     break;
	  case 2:  // 控制终端连接指定服务器
	        /*
连接控制；监管平台鉴权码；拨号点名称； 拨号用户名；拨号密码；地址；TCP端口；UDP端口；连接到指定服务器时限
           若每个参数无数值，则放空
	         */  
	         rt_kprintf("\r\n 终端控制连接指定服务器\r\n");  
			 rt_kprintf("\r\n 内容: %s\r\n",Content);
			 break;
	  case 3:  //  终端关机
              SD_ACKflag.f_CentreCMDack_0001H=5; 
			  rt_kprintf("\r\n 终端关机 \r\n");  
	         break;
      case 4:  //  终端复位
               SD_ACKflag.f_CentreCMDack_0001H=3;
			   rt_kprintf("\r\n 终端复位 \r\n");          
	         break;
	  case 5: //   终端恢复出厂设置		 	
	  	       
	           /* if(SysConf_struct.Version_ID==SYSID)   //  check  wether need  update  or not 
	          	{                    
					SysConf_struct.Version_ID=SYSID+1;   
					Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
					Systerm_Reset_counter=Max_SystemCounter;
					ISP_resetFlag=2;    //   借助远程下载重启机制复位系统 
	          	}
				rt_kprintf("\r\n 恢复出厂设置 \r\n");  */
			 break;
	  case 6: //   关闭数据通信
             SD_ACKflag.f_CentreCMDack_0001H=5; 
			 rt_kprintf("\r\n 关闭数据通信 \r\n"); 
	         break;
	  case 7: //   关闭所有无线通信
             SD_ACKflag.f_CentreCMDack_0001H=5; 
			 rt_kprintf("\r\n 关闭所有通信 \r\n");   
		     break;
	  default:
	  	     return false;			 

   }
      return  true;
}

//-------------------------------------------------------------------
void CenterSet_subService_8701H(u8 cmd,  u8*Instr)
{  
 
  
  switch(cmd)
   {
     case 0x81: //	  中心设置 驾驶员代码  驾驶证号码
				memset(JT808Conf_struct.Driver_Info.DriverCard_ID,0,18);
                //  驾驶员代码没有处理 3个字节 
				memcpy(JT808Conf_struct.Driver_Info.DriveCode,Instr,3); 						   
			       memcpy(JT808Conf_struct.Driver_Info.DriverCard_ID,Instr+3,18); //只要驾驶证号码
				 Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
				break;
   
	 case 0x82: //	  中心设置车牌号  
				memset((u8*)&JT808Conf_struct.Vechicle_Info,0,sizeof(JT808Conf_struct.Vechicle_Info));		
			
                memcpy(JT808Conf_struct.Vechicle_Info.Vech_VIN,Instr,17);
				memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,Instr+17,12);
				memcpy(JT808Conf_struct.Vechicle_Info.Vech_Type,Instr+29,12); 

				Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));    
				break;
	 case 0xC2: //设置记录仪时钟
			    // 没啥用，给个回复就行，俺有GPS校准就够了 

		        break;

	 case 0xC3: //车辆速度脉冲系数（特征系数）
				 JT808Conf_struct.Vech_Character_Value=(u32)(Instr[0]<<16)+(u32)(Instr[1]<<8)+(u32)Instr[2]; // 特征系数  速度脉冲系数
				
				 JT808Conf_struct.DF_K_adjustState=0;		
		                ModuleStatus&=~Status_Pcheck; 
	                      Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
		        break;
	 default:
				break;
   }


}
//-----------------------------------------------
u8  CentreSet_subService_FF01H(u32 SubID, u8 infolen, u8 *Content )
{  
 
 
  u32  baud=0;
  u8    u3_Txstr[40];
  u8    Destu3_Txstr[40];
  u8    len=0;
		u8 i=0;


   rt_kprintf("\r\n    收到扩展终端设置命令 SubID=%X \r\n",SubID);  
	   
  switch(SubID)
   {
     case 0x0001:  //GNSS 定位模式切换
                    if(infolen!=4)
						break;			 		
		      BD_EXT.BD_Mode=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];

		      switch(BD_EXT.BD_Mode)
		      	{
                         case 0x00:  // 单 GPS 定位模式                        
						   gps_mode("2");
						 break;
			    case  0x01:  // 	单BD2 定位模式
			                        gps_mode("1");
				               break;
			    case  0x02: //  BD2+GPS 定位模式
						   gps_mode("3");
				               break;							   	
		      	}
                    //BD_EXT_Write();   
                    break;
	 case 0x0002:  // GNSS 波特率设置            
                    if(infolen!=4)
						break;					
			BD_EXT.BD_Baud=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
			switch(BD_EXT.BD_Baud)
				{ 
				    case 0x00:  //  4800
                                                  baud=4800;    
							//rt_thread_delay(5);						  
							//gps_write("$PCAS01,0*1C\r\n",14);	
							//rt_thread_delay(5);	
							// gps_baud( 4800 );
						        break;
				     case 0x01: //9600   --default 
				                     baud=9600;
							//rt_thread_delay(5);			 
                                                 //gps_write("$PCAS01,1*1D\r\n",14);	
							//rt_thread_delay(5);
							//gps_baud( 9600 );
						        break;
				     case  0x02: // 19200
				                     baud=19200;
							//rt_thread_delay(5);			 
                                                 //gps_write("$PCAS01,2*1E\r\n",14);	
							//rt_thread_delay(5);	
							//gps_baud( 19200 );
					               break;
				     case  0x03://  38400
                                                  baud=38400;
							 //rt_thread_delay(5);						  
							 //gps_write("$PCAS01,3*1F\r\n",14);	
							 //rt_thread_delay(5);	
							 //gps_baud( 38400 ); 
					               break;
				     case  0x04:// 57600
				                      baud=57600;
							 //rt_thread_delay(5);			  
                                                  //gps_write("$PCAS01,4*18\r\n",14);	
							 //rt_thread_delay(5);		
							 //gps_baud( 57600 );
					               break;
				     case   0x05:// 115200
				                      baud=115200; 
							//rt_thread_delay(5);			  
                                                 // gps_write("$PCAS01,5*19\r\n",14);	
							 //rt_thread_delay(5);	
							// gps_baud( 115200 ); 
					               break;				    				

				}
		      	 //---UART_GPS_Init(baud);  //   修改串口波特率 
		      	 rt_thread_delay(20);
                      // BD_EXT_Write();   
			rt_kprintf("\r\n 中心设置GNSS 波特率:  %d s\r\n",baud); 
	                break;
	 case 0x0003:  //  BNSS NMEA 输出更新率               
                    if(infolen!=4)
						break;					
 		       BD_EXT.BD_OutputFreq=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                     switch(BD_EXT.BD_OutputFreq)
                     	{
                                 case 0x00: 
							 baud=500;
							 gps_write("$PCAS02,500*1A\r\n",16);	
 							 rt_thread_delay(5);	
							 break;
				     case 0x01:
					 	          baud=1000;
							  gps_write("$PCAS02,1000*2E\r\n",16);
							  rt_thread_delay(5);	
							  break;
				     case 0x02: 			  
							  baud=2000;
							 gps_write("$PCAS02,2000*2D\r\n",16);
							 rt_thread_delay(5);	
							  break;
				     case  0x03:
					 	         baud=3000;
							 gps_write("$PCAS02,3000*2C\r\n",16);
							 rt_thread_delay(5);	
							 break;
				     case  0x04:
					 	        baud=4000;
							 gps_write("$PCAS02,4000*2B\r\n",16);
							 rt_thread_delay(5);	
							 break;

