nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
                     	}
			     // BD_EXT_Write();   
			      rt_kprintf("\r\n  GNSS 输出更新: %dms\r\n",baud);  
	                break;
	 case 0x0004:  // GNSS 采集NMEA 数据频率               
                    if(infolen!=4)
						break;					
			 BD_EXT.BD_SampleFrea=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                       rt_kprintf("\r\n GNSS 采集频率: %d s\r\n", BD_EXT.BD_SampleFrea);   
	                break;
	 case 0x0005:  //  CAN 1  参数设置               
                    if(infolen!=4)
						break;					
			BD_EXT.CAN_1_Mode=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                     CAN_App_Init();
			//BD_EXT_Write();   
			rt_kprintf("\r\n 中心设置CAN1 : 0x%08X\r\n",BD_EXT.CAN_1_Mode); 
			break;
	 case 0x0006:  //  CAN2   参数设置    ----- 要和小板通信
                    if(infolen!=4)
						break;					
			BD_EXT.CAN_2_Mode=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                    // BD_EXT_Write();  
			memset( u3_Txstr,0,sizeof(u3_Txstr));
			memset( Destu3_Txstr,0,sizeof(Destu3_Txstr));		 
			u3_Txstr[0]=0x7E;       // 头
		       u3_Txstr[1]=0x33;		//  CAN 相关
		       u3_Txstr[2]=0x01;    //  参数设置 
		       u3_Txstr[3]=(BD_EXT.CAN_2_Mode>>24);
			u3_Txstr[4]=(BD_EXT.CAN_2_Mode>>16);   	
	              u3_Txstr[5]=(BD_EXT.CAN_2_Mode>>8);	       
                     u3_Txstr[6]=(BD_EXT.CAN_2_Mode);	  
			u3_Txstr[7]=0x7E;	              				 

                     Destu3_Txstr[0]=0x7E;
			len=Protocol_808_Encode(Destu3_Txstr+1, u3_Txstr+1, 6);
			Destu3_Txstr[len+1]=0x7E;
		
			rt_kprintf("\r\n U3_orginal:");
			for(i=0;i<8;i++)
				rt_kprintf("% 02X",u3_Txstr[i]); 
			rt_kprintf("\r\nU3_len=%d \r\n",len);
			for(i=0;i<len+2;i++)
				rt_kprintf("% 02X",Destu3_Txstr[i]);     
			 // U3_PutData(Destu3_Txstr,len+2);  //  发送给串口	
			rt_device_write(&Device_CAN2,0, Destu3_Txstr,len+2);       
			rt_kprintf("\r\n 中心设置CAN2 : 0x%08X\r\n",BD_EXT.CAN_2_Mode);    
	                break; 
        case 0x0007:  //  碰撞参数设置
                    if(infolen!=4)
						break;					
			BD_EXT.Collision_Check=(Content[0]<<24)+(Content[1]<<16)+(Content[2]<<8) +Content[3];
                     //BD_EXT_Write();   
			memset( u3_Txstr,0,sizeof(u3_Txstr));
			memset( Destu3_Txstr,0,sizeof(Destu3_Txstr));		 
			u3_Txstr[0]=0x7E;       // 头
		       u3_Txstr[1]=0x32;		//  CAN 相关 
		       u3_Txstr[2]=0x01;    //  参数设置 
		       u3_Txstr[3]=(BD_EXT.Collision_Check>>24);
			u3_Txstr[4]=(BD_EXT.Collision_Check>>16);   	
	              u3_Txstr[5]=(BD_EXT.Collision_Check>>8);	       
                     u3_Txstr[6]=BD_EXT.Collision_Check;	 
			u3_Txstr[7]=0x7E;	               				 

			Destu3_Txstr[0]=0x7E;
			len=Protocol_808_Encode(Destu3_Txstr+1, u3_Txstr+1, 6);
			Destu3_Txstr[len+1]=0x7E;

			//   设置配置碰撞参数
			mma8451_config((uint16_t) (BD_EXT.Collision_Check>>16),(uint16_t) (BD_EXT.Collision_Check));
			rt_kprintf("\r\n 中心设置碰撞参数: 0x%08X\r\n",BD_EXT.Collision_Check);; 
	              break; 
		
	 default: 
				return false; 
   }
   rt_thread_delay(20);	   	  
    return true;
}
//--------------------------------------------------
u8  CentreSet_subService_FF03H(u32 SubID, u8 infolen, u8 *Content )
{  
    u8  i=0;
    u8    u3_Txstr[40];
    u8    Destu3_Txstr[40];
    u8    len=0;


   rt_kprintf("\r\n    收到扩展终端参数设置1 命令 SubID=%X \r\n",SubID);  
	   
  switch(SubID)
   {
     case 0x0001:  // CAN ID 设置
                    if(infolen<4)
						break;			 		
		        // Content[0];  //  设置属性
			  //Content[1] ;//本消息中包含CAN ID 的数量
		     //------------------------------------	  
			//Content[2];  //  CAN ID 的ID 			
		     if(Content[3]&0x80)//  CAN ID   的属性  
		     	{
			      BD_EXT.CAN_2_ID=(Content[4]<<24)+(Content[5]<<16)+(Content[6]<<8)+Content[7];// 
                            if(Content[3]&0x40)
					 BD_EXT.CAN_2_Type=1; // 标准帧
				else 
					 BD_EXT.CAN_2_Type=0;  
			      BD_EXT.CAN_2_Duration=(Content[9]<<8)+Content[10];   // 0   表示停止

				 
				//     得有个和小板通信的处理
				memset( Destu3_Txstr,0,sizeof(Destu3_Txstr));		 
				u3_Txstr[0]=0x7E;       // 头
			       u3_Txstr[1]=0x33;		//  CAN 相关
			       u3_Txstr[2]=0x02;    //  参数设置 
			       u3_Txstr[3]=Content[3]; // 属性
			       u3_Txstr[4]=Content[4]; //  ID 
				u3_Txstr[5]=Content[5];   	
		              u3_Txstr[6]=Content[6];	       
	                     u3_Txstr[7]=Content[7];
				u3_Txstr[8]=Content[8]; // ID 		 
				u3_Txstr[9]=Content[9]; 	//
				u3_Txstr[10]=Content[10]; 	
				u3_Txstr[11]=0x7E;	              				 

				 Destu3_Txstr[0]=0x7E;
			        len=Protocol_808_Encode(Destu3_Txstr+1, u3_Txstr+1, 10);  
			        Destu3_Txstr[len+1]=0x7E;

			       rt_kprintf("\r\nU3_len=%d   :\r\n",len);  
			       for(i=0;i<len+2;i++)
				        rt_kprintf("% 02X",Destu3_Txstr[i]);     	 
				   
			       // U3_PutData(Destu3_Txstr,len+2);  //  发送给串口	
			       rt_device_write(&Device_CAN2,0, Destu3_Txstr,len+2);       
				rt_kprintf("\r\n 中心设置CAN2 : 0x%08X   Dur: %d s\r\n",BD_EXT.CAN_2_ID,BD_EXT.CAN_2_Duration);     
			        //----------------------------------
			 } 
			 else
     			   {
      			       BD_EXT.CAN_1_ID=(Content[4]<<24)+(Content[5]<<16)+(Content[6]<<8)+Content[7];// 
                             if(Content[3]&0x40)   
					 BD_EXT.CAN_1_Type=1; // 标准帧
				else 
					 BD_EXT.CAN_1_Type=0;   
				 BD_EXT.CAN_1_Duration=(Content[9]<<8)+Content[10];  // 0   表示停止  

				rt_kprintf("\r\n 中心设置CAN1 : 0x%08X   Dur: %d s\r\n",BD_EXT.CAN_1_ID,BD_EXT.CAN_1_Duration);    

			   }   
                    BD_EXT_Write();    
                    break;
	 case 0x0002:  // 文本信息标志含义     
	            // Content[0]; // 没用
	              //if((Content[1]==0)||(Content[1]==1))  //  部分类型都给显示屏 
	             	{
				memset( TextInfo.TEXT_Content,0,sizeof(TextInfo.TEXT_Content));
				DwinLCD.TxInfolen=AsciiToGb(TextInfo.TEXT_Content,infolen-2,Content+2);
				//memcpy(TextInfo.TEXT_Content,Content+2,infolen-2);
				TextInfo.TEXT_SD_FLAG=1;	// 置发送给显示屏标志位  // ||||||||||||||||||||||||||||||||||
                            rt_kprintf("\r\n  CAN 文本:  "); 
				for(i=0;i<DwinLCD.TxInfolen;i++) 
							 rt_kprintf("%c",TextInfo.TEXT_Content[i]);
				  rt_kprintf("\r\n ");
			}	

