nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
		          #ifdef LCD_5inch
						           //======  信息都在屏幕上显示  
                                                   memset(DwinLCD.TXT_content,0,sizeof(DwinLCD.TXT_content)); 
                                                   DwinLCD.TXT_contentLen=AsciiToGb(DwinLCD.TXT_content,infolen-2,Content+2);  						  
							  DwinLCD.Type=LCD_SDTXT;  						
							   
			   #endif  		

		      break;
	 default: 
				return false;
   }
    return true;
}
//-----------------------------------------------
void  ISP_Get_RawData(u8 * Instr, u16  InLen)
{
      memcpy(ISP_Raw,Instr,InLen);
      ISP_NeedtoProcessFlag=1;	 	
}
void Nullpro_8900H(u8*Instr)
{  
      u16	i=0,DF_PageAddr=0;
	  u16  infolen=0;//,contentlen=0;
	  u8   New_CMD=0;
	//  u8   CenterAckCameraFlag=0;
	//  u8   ireg[5]; 
	  u8   FCS_RX_UDP_sub=0;

  //  2.   get infolen    CMD 
  infolen=( u16 )(Instr[11] << 8 ) + ( u16 ) Instr[12]; 
//  contentlen=infolen-14;  //  8+2+1+1+1+1
  New_CMD = Instr[15];  
 //   4 .  Classify  Process 
   // rt_kprintf("\r\n New_CMD=%X",New_CMD);
     switch(New_CMD)
   {
  		   case  0x91:     //   中心下发远程下载开始命令
					       ISP_rxCMD=New_CMD; 
						f_ISP_ACK=1;						
							rt_kprintf( "\r\n ISP request! \r\n" ); 					   
						//------------- ISP state ------------------------	
						ISP_running_state=1;
						ISP_running_counter=0;
						ISP_RepeatCounter=0;
					  break;
		   case  0x93:     //   中心下发远程下载数据内容命令
		                       rt_kprintf("\r\n infolen=%d",infolen);
                                     //--------------------------------------- 
                                    ISP_current_packnum=((u16)Instr[16]<<8)+(u16)Instr[17];
					  ISP_total_packnum=((u16)Instr[18]<<8)+(u16)Instr[19]; 
					    ISP_ack_resualt=0x01;   // ok		
						ISP_RepeatCounter=0;
					  //--------------------------------------		   
				        ISP_running_state=1;
					 ISP_running_counter=0;   			                
					 f_ISP_88_ACK=1;			
					  break;
		   case  0x95:     //   中心下发远程下载结束命令
					   f_ISP_23_ACK=1;					   
					   rt_kprintf( "\r\n ISP download over! \r\n" ); 
					   //------------- ISP state ------------------------  
					   ISP_running_state=1;
					   ISP_running_counter=0; 
					   ISP_RepeatCounter=0; 
			          break;
		    default:
				      break;  	
   }


}


void DataTrans_ISPService_8900H(u8*Instr)
{  
      u16	i=0,DF_PageAddr=0;
	  u16  infolen=0;//,contentlen=0;
	  u8   New_CMD=0;
	//  u8   CenterAckCameraFlag=0;
	//  u8   ireg[5]; 
	  u8   FCS_RX_UDP_sub=0;
  //  1. Sub Protocol check 
   if(strncmp((char*)Instr, "*GB",3) != 0)           //   过滤头 
  	   return;
 
  //  2.   get infolen    CMD 
  infolen=( u16 )(Instr[11] << 8 ) + ( u16 ) Instr[12]; 
//  contentlen=infolen-14;  //  8+2+1+1+1+1
  New_CMD = Instr[15];  

  //  3.   Check  Fcs  
	  FCS_RX_UDP_sub=0;
	  for ( i=0; i <(infolen-1); i++ ) //先算出收到数据的异或和  长度包括校验所以信息长度应减1
		  {
			  FCS_RX_UDP_sub^=Instr[3+i];	
		  } 
	  // ------- FCS filter -----------------
	  if( Instr[infolen+2]!= FCS_RX_UDP_sub ) 	   
		  {
			  rt_kprintf("\r\n ISP校验错误	  Caucate %x  ,RX  %x\r\n",FCS_RX_UDP_sub,Instr[infolen+2]); 
				//-----------------  memset  -------------------------------------
			  return; 
		  }
	  else		 
		  rt_kprintf("\r\nISP校验正确	  Caucate %x  ,RX  %x\r\n",FCS_RX_UDP_sub,Instr[infolen+2]);	  
   
 //   4 .  Classify  Process 
   // rt_kprintf("\r\n New_CMD=%X",New_CMD);
     switch(New_CMD)
   {
  		   case  0x91:     //   中心下发远程下载开始命令
					       ISP_rxCMD=New_CMD; 
						f_ISP_ACK=1;						
							rt_kprintf( "\r\n ISP request! \r\n" ); 					   
						//------------- ISP state ------------------------	
						ISP_running_state=1;
						ISP_running_counter=0;
						ISP_RepeatCounter=0;
					  break;
		   case  0x93:     //   中心下发远程下载数据内容命令
		                       rt_kprintf("\r\n infolen=%d",infolen);
		               #if 0
						if(532!=infolen)   
						{
							  ISP_current_packnum=((u16)Instr[16]<<8)+(u16)Instr[17]; 
							  ISP_total_packnum=((u16)Instr[18]<<8)+(u16)Instr[19]; 
							 // rt_kprintf("\r\n ISP_current_packnum=%d,ISP_total_packnum=%d",ISP_current_packnum,ISP_total_packnum);
						
							  f_ISP_88_ACK=1;
							  ISP_ack_resualt=0x02;   // no  pass
							  rt_kprintf( "\r\n Total packet len	error! \r\n" );
						}
						else
						  {
							   ISP_current_packnum=((u16)Instr[16]<<8)+(u16)Instr[17];
							   ISP_total_packnum=((u16)Instr[18]<<8)+(u16)Instr[19]; 
					         //  rt_kprintf("\r\n ISP_current_packnum=%d,ISP_total_packnum=%d",ISP_current_packnum,ISP_total_packnum);
						
								if(ISP_current_packnum<=ISP_total_packnum)
								  {
							   
									//------------------------------
									DF_PageAddr=(u16)(Instr[20]<<8)+Instr[21];  //page
									//rt_kprintf("\r\n 写入Page=%d\r\n",DF_PageAddr);
						
									//-----------  protect	RAM data  ------
									if((DF_PageAddr>=DF_BL_PageNo)&&(DF_PageAddr<DF_PageAddr))
										break; 
									
									//---------------- write APP data --------- 
									ISP_Format(DF_PageAddr,0,Instr+22,PageSIZE);
					
									//rt_kprintf("\r\n写内容:\r\n ");
									//for(i=0;i<PageSIZE;i++)
										//rt_kprintf("%X ",Instr[22+i]);
								    // rt_kprintf("\r\n读内容:\r\n ");	
								      rt_thread_delay(5); 
								       rt_kprintf("\r\n清除ISP 区域\r\n ");	
									ISP_Read(DF_PageAddr, ISP_buffer,PageSIZE);  
									//for(i=0;i<PageSIZE;i++)
									//	rt_kprintf("%X ",ISP_buffer[i]);
									//rt_kprintf("\r\n"); 
									for(i=0;i<PageSIZE;i++)
									{
										 if(Instr[22+i]!=ISP_buffer[i]) 
										   {
											   //------------- ISP state ------------------------
											   ISP_running_state=1;
											   ISP_running_counter=0; 
											   rt_kprintf( "\r\n i=%d  读取和写不匹配! \r\n",i );  
											   break; 
										   }
									}  									
									if(i<PageSIZE)
									 {
									   rt_kprintf( "\r\n DFwrite error!\r\n" );
									   ISP_ack_resualt=0x02;   // no pass
									   ISP_RepeatCounter++;
									   if(ISP_RepeatCounter>6)
									   	{
                                                                          ISP_RepeatCounter=0;
										    rt_kprintf("\r\n 超过最大错误5次数，清除远程升级区域!\r\n");
                                                                          DF_ClearUpdate_Area();  
									   	}
									 } 
									else  
										
									 {
									   ISP_ack_resualt=0x01;   // ok		
									   ISP_RepeatCounter=0;
									 } 
								   //---------------------------------
								   rt_thread_delay(10);  // 不加会导致堆栈溢出
								   
								   f_ISP_88_ACK=1;								   
						  }
				             }
						//------------- ISP state ------------------------
					#endif	
				        ISP_running_state=1;
					 ISP_running_counter=0;   			                
					 f_ISP_88_ACK=1;			
					  break;
		   case  0x95:     //   中心下发远程下载结束命令
					   f_ISP_23_ACK=1;					   
					   rt_kprintf( "\r\n ISP download over! \r\n" ); 
					   //------------- ISP state ------------------------  
					   ISP_running_state=1;
					   ISP_running_counter=0; 
					   ISP_RepeatCounter=0; 
			          break;
		    default:
				      break;  	
   }


