nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}
void  ISP_Process(void)
{
      if(1==ISP_NeedtoProcessFlag)
      	{
      	      rt_kprintf( "\r\n ISP _process \r\n" ); 
      	     //DataTrans_ISPService_8900H(ISP_Raw);
      	     f_ISP_ACK=1;	
            ISP_running_state=1;
		ISP_running_counter=0;
		ISP_RepeatCounter=0;
	     //----------------------		 
            ISP_NeedtoProcessFlag=0;
      	}	
}


u8 ISP_running_Status(void)
{ 
     return   ISP_running_state;
}

//-------------------------------------------
void  Media_Start_Init( u8  MdType , u8  MdCodeType)
{  
  MediaObj.Media_Type=MdType;//	指定当前传输多媒体的类型   0  表示图片
  MediaObj.Media_CodeType=MdCodeType;  //  多媒体编码格式   0  表示JPEG	格式 
  MediaObj.SD_media_Flag=1;   //  置多媒体事件信息发送标志位  ，开始图片传输  
  MediaObj.SD_Eventstate=1;		  //  开始处于发送状态 
  MediaObj.RSD_State=0;  
  MediaObj.RSD_Timer=0;
  MediaObj.RSD_total=0;
  MediaObj.RSD_Reader=0;
  MediaObj.SD_Data_Flag=0; 
  MediaObj.Media_transmittingFlag=0;      
   //------------  add  for debuging   --------------
  // Media_Clear_State();  //  clear  
 /*  if(0==MediaObj.Media_Type)
	{
	   Photo_sdState.photo_sending=enable; 
	   Photo_sdState.SD_packetNum=1; // 第一包开始  
	   rt_kprintf("\r\n 开始上传照片! ....\r\n");  												
    }
  */
   //---------------------------------------------------- 
}

void Media_Clear_State(void)
{
     // 不清楚Meia Type
    MediaObj.MaxSd_counter=0;
    MediaObj.SD_Eventstate=0;
    MediaObj.SD_timer=0;
    MediaObj.SD_media_Flag=0;	
	MediaObj.SD_Data_Flag=0; 
	MediaObj.RSD_State=0;
	MediaObj.RSD_Timer=0;
	MediaObj.RSD_total=0;
	MediaObj.RSD_Reader=0;
	MediaObj.Media_transmittingFlag=0;
}
void  Media_Timer(void)
{
  if(1==MediaObj.SD_Eventstate) 
  	{
  	  MediaObj.SD_timer++;
      if(MediaObj.SD_timer>6) 
      	{
            MediaObj.SD_timer=0;			
            MediaObj.SD_media_Flag=1; 
			MediaObj.MaxSd_counter++;
			if(MediaObj.MaxSd_counter>5)
                   Media_Clear_State();  
      	}

  	}
}
void Media_RSdMode_Timer(void)
{
    if((1==MediaObj.RSD_State))
	   	{ 
	        MediaObj.RSD_Timer++;
			if(MediaObj.RSD_Timer>10) 
				{
	              MediaObj.RSD_Timer=0;
				  MediaObj.SD_Data_Flag=1; // 置重传发送多媒体信息标志位
				  switch(MediaObj.Media_Type)    //   图片重传包数
				  	{
				  	 case 0://  图像
				  	         Photo_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                         Photo_sdState.SD_flag=1;
							 break;
					 case 1:// 音频                             
				  	         Sound_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
	                         Sound_sdState.SD_flag=1;  
					         break;
					 case 2:// 视频
							 Video_sdState.SD_packetNum=MediaObj.Media_ReSdList[MediaObj.RSD_Reader];
							 Video_sdState.SD_flag=1;  					          
					         break;
				     default:
					 	     break;

				  	}	
				}
	   	} 
      else
	  if(2==MediaObj.RSD_State)
	  {
          MediaObj.RSD_Timer++;		  
		  if(MediaObj.RSD_Timer>120)   //   如果状态一直在等待且超过30s择清除状态 
		  { 
		     switch (MediaObj.Media_Type)
	         {
	          case 0 : // 图像
	                  Photo_send_end();  // 拍照上传结束
	                  
			          break;
			  case 1 : // 音频
			         Sound_send_end();  
			          break;
			  case 2 : // 视频
                               Video_send_end();
			          break;
			  default:
			  	      break;
	         } 
            Media_Clear_State();
			rt_kprintf("\r\n 信息重传超时结束! \r\n");
			
			Check_MultiTakeResult_b4Trans();  // 多路摄像头拍照状态检测
			
		  }

	  }
   


	
}
#ifdef   MEDIA
//-------- photo send -------------------------------------
void Photo_send_start(u16 Numpic)  
{
  
//  UINT ByteRead;  
 // FIL FileCurrent; 

        rt_kprintf("   \r\n  Photo_send_start =%d \r\n",Numpic); 
        Photo_sdState.photo_sending=disable;  
	 Photo_sdState.SD_flag=0;  
	 Photo_sdState.SD_packetNum=1; // 从1 开始
        Photo_sdState.Exeption_timer=0;
	 
	if(Camera_Number==1)
	             PicFileSize=Api_DFdirectory_Query(camera_1, 1);
	else
	if(Camera_Number==2)
		     PicFileSize=Api_DFdirectory_Query(camera_2, 1);	   
	else
	if(Camera_Number==3)
		     PicFileSize=Api_DFdirectory_Query(camera_3, 1);   
	else
	if(Camera_Number==4)
		     PicFileSize=Api_DFdirectory_Query(camera_4, 1);    		
		
		
      //	 DF_ReadFlash(pic_current_page, 0,PictureName, 23);
     //      Camera_Number=PictureName[18]; 
     //      memcpy((u8*)&PicFileSize,PictureName+19,4); 
	 //pic_current_page++; //指向文件内容 
	 //pic_PageIn_offset=0;// 图片读取页内偏移地址 
	// rt_kprintf("\r\n    open Pic =%s",PictureName); 
	  
	  if(PicFileSize%512)
	     Photo_sdState.Total_packetNum=PicFileSize/512+1;
	  else
	  	 Photo_sdState.Total_packetNum=PicFileSize/512;

	 rt_kprintf("\r\n    Camera %d  ReadpicStart total :%d ，Pagesize: %d Bytes\r\n\r\n",Camera_Number,Photo_sdState.Total_packetNum,PicFileSize);    
	 if((Camera_Number==0)||(Photo_sdState.Total_packetNum==0))
	 {
	   Photo_send_end(); // clear  state 
       rt_kprintf("\r\n  图片总包数为空 ，摄像头序号为0 ，发送拍照失败到中心 \r\n");    
	 }


      // -------  MultiMedia Related --------
      Media_Start_Init(0,0);

}

u8  Sound_send_start(void)
{
  u8 sound_name[20]; 
  u16  i;
//  u8  oldstate=0;
//  u16 i2,j; 
 // u8  WrieEnd=0,LeftLen=0; 
  

  Sound_sdState.photo_sending=disable;  
  Sound_sdState.SD_flag=0;  
  Sound_sdState.SD_packetNum=1; // 从1 开始
  Sound_sdState.Exeption_timer=0;
   
 //---  Speex_Init();	 // speachX 初始化	 
  // 1. 查找最新的文件
/*  memset((u8*)&MediaIndex,0,sizeof(MediaIndex)); 
  for(i=0;i<8;i++)
  {
	 Api_RecordNum_Read(voice_index, i+1, (u8*)&MediaIndex, sizeof(MediaIndex));
        if(MediaIndex.Effective_Flag==1)
        {  
            break;
	  }       
  }
  if(MediaIndex.Effective_Flag)  	
  { 
	rt_kprintf("\r\n 索引filename:%s\r\n",MediaIndex.FileName);
  }	
  else
  	{
  	   rt_kprintf("\r\n 没有已存储的音频文件 \r\n");
  	   return false	;
  	}

*/
    
	//	2.	创建wav 文件   

	//	3. 文件大小
	  // file name
	memset(sound_name,0,sizeof(sound_name));
	DF_ReadFlash(SoundStart_offdet, 4, sound_name,20);
       SrcFileSize=Api_DFdirectory_Query(voice, 1);
     //  Sound_sdState.Total_packetNum=(SrcFileSize/512); // 每包100个字节
        if(SrcFileSize%512)
	     Sound_sdState.Total_packetNum=SrcFileSize/512+1;
	  else
	  	 Sound_sdState.Total_packetNum=SrcFileSize/512; 
	rt_kprintf("\r\n	文件名: %s大小: %d Bytes  totalpacketnum=%d \r\n",sound_name,SrcFileSize,Sound_sdState.Total_packetNum);
  
    // -------  MultiMedia Related --------
      Media_Start_Init(1,3); // 音频  wav 格式   0:JPEG ;   1: TIF ;   2:MP3;  3:WAV  4: WMV  其他保留   
                                           //    5   amr
     return true;  
}

