nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					 if(Warn_Status[0]&0x60)
			                      Warn_Status[0]&=~0x60;    // 2 个bit 	  碰撞和侧翻

									  //------------------------------------  
										 rt_kprintf( "\r\nCentre ACK!\r\n");  	
									   // Api_cycle_Update();   
									   //-------------------------------------------------------------------
									  /* cycle_read++;   //  收到应答才递增
									   if(cycle_read>=Max_CycleNum)
											   cycle_read=0;
									   ReadCycle_status=RdCycle_Idle;
                                                                 */

							        /*		   
                                                          //--------------  多媒体上传相关  --------------                                       
									 if(MediaObj.Media_transmittingFlag==1)  // clear									      
									     {
									         MediaObj.Media_transmittingFlag=2;   
											 if(Duomeiti_sdFlag==1)
											  { 
											      Duomeiti_sdFlag=0; 
											      Media_Clear_State();
												Photo_send_end();
												Sound_send_end();
												Video_send_end();
                                                                                     rt_kprintf("\r\n  手动上报多媒体上传处理\r\n");
											  }	
											 rt_kprintf("\r\n  多媒体信息前的多媒体发送完毕 \r\n");  
									   	  }	
									 WatchDog_Feed();      
							       */
								       break;
				  case 0x0002:  //  心跳包的应答
                                       //  不用判结果了  ---     
                                        JT808Conf_struct.DURATION.TCP_ACK_DurCnter=0;//clear
                                        JT808Conf_struct.DURATION.TCP_SD_state=0; //clear
                                         rt_kprintf( "\r\n  Centre  Heart ACK!\r\n");  
							           break;
                            case 0x0101:  //  终端注销应答
                                        if(0==UDP_HEX_Rx[17])
                                        {  // 注销成功
                                          
										 memset(Reg_buf,0,sizeof(Reg_buf));
 										 memcpy(Reg_buf,JT808Conf_struct.ConfirmCode,20);
 										 JT808Conf_struct.Regsiter_Status=0; 
 										 Reg_buf[20]=JT808Conf_struct.Regsiter_Status; 
 										Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
										 rt_kprintf("\r\n  终端注销成功!  \r\n"); 
                                        }  

							           break;
						    case 0x0102:  //  终端鉴权
						                
 						                rt_kprintf("\r\n 收到鉴权结果: %x \r\n",UDP_HEX_Rx[17]); 
						                if(0==UDP_HEX_Rx[17])
                                         {  // 鉴权成功 
                                                          DEV_Login.Operate_enable=2; // 鉴权完成
                                                          DEV_Login.Sd_add=0;// clear
					                        if(DataLink_Status())   
							                   DataLinkOK_Process();
											 rt_kprintf("\r\n  终端鉴权成功!  \r\n");   
											 
						                }
									   break;
                            case 0x0800:  // 多媒体事件信息上传
                                             rt_kprintf("\r\n 多媒体事件信息上传回应! \r\n");											 
											 Media_Clear_State();  //  clear 
											 
                                            if(0==MediaObj.Media_Type)
											{
											   MediaObj.Media_transmittingFlag=1; 
											   PositionSD_Enable(); 
											   Current_UDP_sd=1;
											   
											   Photo_sdState.photo_sending=enable; 
											   Photo_sdState.SD_packetNum=1; // 第一包开始 
											   PositionSD_Enable();  //   使能上报
											   rt_kprintf("\r\n 开始上传照片! ....\r\n");   												
                            	            }
											else
											if(1==MediaObj.Media_Type)
											{
											   MediaObj.Media_transmittingFlag=1;  
											   
											   Sound_sdState.photo_sending=enable; 
											   Sound_sdState.SD_packetNum=1; // 第一包开始 
											   PositionSD_Enable();  //   使能上报 
											   Current_UDP_sd=1;
											   rt_kprintf("\r\n 开始上传音频! ....\r\n");    												
                            	            }	
											else
											if(2==MediaObj.Media_Type)
											{
											   MediaObj.Media_transmittingFlag=1;   
											   PositionSD_Enable();  //   使能上报
											   Current_UDP_sd=1;
											   Video_sdState.photo_sending=enable; 
											   Video_sdState.SD_packetNum=1; // 第一包开始   
											   rt_kprintf("\r\n 开始上传视频! ....\r\n");    												
                            	            }	
											break;
						    case 0x0702: 
                                          rt_kprintf("\r\n  驾驶员信息上报---中心应答!  \r\n"); 							       
											 
							           break;
							case 0x0701: 
                                           rt_kprintf("\r\n  电子运单上报---中心应答!  \r\n"); 							       
											 
							           break;		   
									   
							default	 :
								       break;
					   	}


					    //---------------------
					      //   PositionSD_Enable();
						//  Current_UDP_sd=1;
						//-------------------				
				        break;
           case  0x8100:    //  监控中心对终端注册消息的应答		
                       //-----------------------------------------------------------
					   switch(UDP_HEX_Rx[15])
                        	{
                               case 0: rt_kprintf("\r\n   ----注册成功\r\n");
							           memset(JT808Conf_struct.ConfirmCode,0,sizeof(JT808Conf_struct.ConfirmCode));
                                       memcpy(JT808Conf_struct.ConfirmCode,UDP_HEX_Rx+16,infolen-3);

									   memset(Reg_buf,0,sizeof(Reg_buf));
							           memcpy(Reg_buf,JT808Conf_struct.ConfirmCode,20);
									   JT808Conf_struct.Regsiter_Status=1; 
									   DEV_regist.Sd_add=0;	// clear    
							               Reg_buf[20]=JT808Conf_struct.Regsiter_Status;
                                                                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
									   rt_kprintf("鉴权码: %s\r\n		   鉴权码长度: %d\r\n",JT808Conf_struct.ConfirmCode,strlen((const char*)JT808Conf_struct.ConfirmCode)); 
                                       //-------- 开始鉴权 ------
									   DEV_Login.Operate_enable=1;  
									   break;
							   case 1: rt_kprintf("\r\n   ----车辆已被注册\r\n");
									   break;	
							   case 2: rt_kprintf("\r\n   ----数据库中无该车辆\r\n");
									   break;
							   case 3: rt_kprintf("\r\n   ----终端已被注册\r\n");  
								           if(0==JT808Conf_struct.Regsiter_Status)  
				                                        {
				                                          ;//JT808Conf_struct.Regsiter_Status=2;  // not  1
				                                          //DEV_regist.DeRegst_sd=1;
											           	}  
													   else
													   if(1==JT808Conf_struct.Regsiter_Status) 
											               DEV_Login.Operate_enable=1; //开始鉴权 
											          
												   break;		    
			                               case 4: rt_kprintf("\r\n   ----数据库中无该终端\r\n");  
												   break;
                        	}					    
		              break;
		   case  0x8103:    //  设置终端参数   
		               //  Ack_Resualt=0;
                      if(contentlen)
                       {                       // 和中心商议好了每次只下发操作一项设置
                         Total_ParaNum=UDP_HEX_Rx[13]; // 中心设置参数总数
                         rt_kprintf("\r\n Set ParametersNum =%d  \r\n",Total_ParaNum);
						 //------------------------------------------------------------------- 
						 ContentRdAdd=14;
						 Process_Resualt=0;  // clear resualt
						 for(i=0;i<Total_ParaNum;i++)
						 {
						   //  数类型是DWORD 4 个字节
						   SubCMD_8103H=(UDP_HEX_Rx[ContentRdAdd]<<24)+(UDP_HEX_Rx[ContentRdAdd+1]<<16)+(UDP_HEX_Rx[ContentRdAdd+2]<<8)+UDP_HEX_Rx[ContentRdAdd+3]; 
                           //  子信息长度
						   SubInfolen=UDP_HEX_Rx[ContentRdAdd+4];
						   //  处理子信息 如果设置成功把相应Bit 位置为 1 否则保持 0
						   if(CentreSet_subService_8103H(SubCMD_8103H,SubInfolen,UDP_HEX_Rx+ContentRdAdd+5))
                                Process_Resualt|=(0x01<<i);						   
						   //  移动偏移地址
						   ContentRdAdd+=5+UDP_HEX_Rx[ContentRdAdd+4]; // 偏移下标
						 } 						   

