nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
						  ROUTE_Obj.RoutePoints[i].POINT_ID=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
						  rt_kprintf("\r\n PointID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_ID);
						  ROUTE_Obj.RoutePoints[i].Line_ID=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                            rt_kprintf("\r\n LineID=%08x\r\n",ROUTE_Obj.RoutePoints[i].Line_ID);
						  ROUTE_Obj.RoutePoints[i].POINT_Latitude=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                             rt_kprintf("\r\n LatiID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_Latitude); 
						  ROUTE_Obj.RoutePoints[i].POINT_Longitude=(UDP_HEX_Rx[reg_u32]<<24)+(UDP_HEX_Rx[reg_u32+1]<<16)+(UDP_HEX_Rx[reg_u32+2]<<8)+UDP_HEX_Rx[reg_u32+3]; 
						  reg_u32+=4;
                                                rt_kprintf("\r\n LongID=%08x\r\n",ROUTE_Obj.RoutePoints[i].POINT_Longitude); 
						  ROUTE_Obj.RoutePoints[i].Width=UDP_HEX_Rx[reg_u32++];  
						     rt_kprintf("\r\n Width=%02x\r\n",ROUTE_Obj.RoutePoints[i].Width); 
						  ROUTE_Obj.RoutePoints[i].Atribute=UDP_HEX_Rx[reg_u32++]; 
						   rt_kprintf("\r\n atrit=%02x\r\n\r\n",ROUTE_Obj.RoutePoints[i].Atribute);         
						   if(ROUTE_Obj.RoutePoints[i].Atribute==0)
                                                            ;
						   else
						    if(ROUTE_Obj.RoutePoints[i].Atribute==1) 
                                                      ROUTE_Obj.RoutePoints[i].MaxSpd=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
                                             else
							 { 
									  ROUTE_Obj.RoutePoints[i].TooLongValue=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
									  ROUTE_Obj.RoutePoints[i].TooLessValue=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++];   
									  ROUTE_Obj.RoutePoints[i].MaxSpd=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++]; 
									  ROUTE_Obj.RoutePoints[i].KeepDur=(UDP_HEX_Rx[reg_u32++]<<8)+UDP_HEX_Rx[reg_u32++];    
						     	}

						}	
                           
						  if((ROUTE_Obj.Route_ID>Route_Mum)||(ROUTE_Obj.Route_ID==0))
									  ROUTE_Obj.Route_ID=1;		
						  ROUTE_Obj.Effective_flag=1;
						  Api_RecordNum_Write(route_line,ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj));// 删除对应的围栏 



                           //----------------
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8607:    //  删除路线
                         rt_kprintf("\r\n  删除路线 \r\n");  
                         if(0==UDP_HEX_Rx[13])   // 区域数
                             RouteLine_Init();  // 删除所有区域
						 else
						 	{						 	  
							  memset((u8*)&ROUTE_Obj,0,sizeof(ROUTE_Obj));  //  clear all  first
						 	  for(i=0;i<UDP_HEX_Rx[13];i++)
						 	  {
						 	    ROUTE_Obj.Route_ID=(UDP_HEX_Rx[14+i]<<24)+(UDP_HEX_Rx[15+i]<<16)+(UDP_HEX_Rx[16+i]<<8)+UDP_HEX_Rx[17+i];
                                if((ROUTE_Obj.Route_ID>Route_Mum)||(ROUTE_Obj.Route_ID==0))
										   	ROUTE_Obj.Route_ID=1;	
								ROUTE_Obj.Effective_flag=0;       
								     Api_RecordNum_Write(route_line,ROUTE_Obj.Route_ID, (u8*)&ROUTE_Obj,sizeof(ROUTE_Obj)); 	  // 删除对应的围栏
						 	  }   
						 	}  

                           //----------------
                    // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;        
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
           case  0x8700:    //  行车记录仪数据采集命令
                       rt_kprintf("\r\n  记录仪采集命令 \r\n");
                       Recode_Obj.Float_ID=Centre_FloatID;
					   Recode_Obj.CMD=UDP_HEX_Rx[13];
					   Recode_Obj.SD_Data_Flag=1;
					   
		              break;
		   case  0x8701:    //  行驶记录仪参数下传命令
		               rt_kprintf("\r\n  记录仪参数下传 \r\n");
		               Recode_Obj.Float_ID=Centre_FloatID;
					   Recode_Obj.CMD=UDP_HEX_Rx[13];    
					   Recode_Obj.SD_Data_Flag=1;  
					   CenterSet_subService_8701H(Recode_Obj.CMD,UDP_HEX_Rx+14); //跳过2B长度和1 保留字
			          break; 
		   case  0x8800:    //   多媒体数据上传应答
		              if(infolen==5)
		              	{  //  判断是否有重传ID列表，如果没有则表示中心接收完成!						
                                switch (MediaObj.Media_Type)
						         {
						          case 0 : // 图像
						                  Photo_send_end();  // 拍照上传结束
						                  rt_kprintf("\r\n 图像传输结束! \r\n");
                                          //------------多路拍照处理  -------
                                         // CheckResualt=Check_MultiTakeResult_b4Trans();  
						                 				   
								          break;
								  case 1 : // 音频
								          Sound_send_end();
										  rt_kprintf("\r\n 音频传输结束! \r\n");
								          break;
								  case 2 : // 视频
									      Video_send_end();
  								          rt_kprintf("\r\n 视频传输结束! \r\n");  
								          break;
								  default:
								  	      break;
						         }
						// if(CheckResualt==0)	
						   	   Media_Clear_State(); 
		              	}
					  else
					  	{  //  重传包ID 列表 
					  	  if(UDP_HEX_Rx[17]!=0)
					  	  {
						  	   MediaObj.RSD_State=1;   //   进入重传状态
						  	   MediaObj.RSD_Timer=0;   //   清除重传定时器   
						  	   MediaObj.RSD_Reader=0;
							   MediaObj.RSD_total=UDP_HEX_Rx[17];    // 重传包总数
						  	   memset(MediaObj.Media_ReSdList,0,125);
							   memcpy(MediaObj.Media_ReSdList,UDP_HEX_Rx+18,UDP_HEX_Rx[17]); 
	                            rt_kprintf("\r\n  重传列表: ");
							   for(i=0;i<MediaObj.RSD_total;i++)
							     rt_kprintf(" %d",UDP_HEX_Rx[18+i]); 
							   rt_kprintf("\r\n"); 
					  	   } 
						}
                        
		              break;
		   case  0x8801:   //    摄像头立即拍照		  

				     Camera_Obj.Channel_ID=UDP_HEX_Rx[13];     //   通道
					 Camera_Obj.Operate_state=UDP_HEX_Rx[18];  //   是否保存标志位  
		            //----------------------------------
				   
