nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
					if((Camera_Take_Enable())&&(Photo_sdState.photo_sending==0)) //图片传输中不能拍
					{
					   Camera_Number=UDP_HEX_Rx[13];
					   if((Camera_Number>Max_CameraNum)&&(Camera_Number<1)) 
						  break;
					 
					   Start_Camera(Camera_Number);   //开始拍照  
					   SingleCamera_TakeRetry=0;   // clear 
					}	   
					rt_kprintf("\r\n   中心及时拍照  Camera: %d    \r\n",Camera_Number);	
		              
                     // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
                      break;
		   case  0x8802:   //    存储多媒体数据检索
		                 SD_ACKflag.f_QueryEventCode=UDP_HEX_Rx[15];    
                         switch(UDP_HEX_Rx[13])
                         {
                            case 0:  // 图像
                                     SD_ACKflag.f_MediaIndexACK_0802H=1;
									 rt_kprintf("\r\n  中心查询图像索引 \r\n");   
							       break;
							case 1:  //  音频
                                     SD_ACKflag.f_MediaIndexACK_0802H=2;
									  rt_kprintf("\r\n  中心查询音频索引 \r\n"); 	 
							case 2:  //  视频
							         SD_ACKflag.f_MediaIndexACK_0802H=3;
						    default:
								     break; 
						}						 
						
		              break;
		   case  0x8803:   //    存储多媒体数据上传命令
                      rt_kprintf("\r\n 多媒体数据上传\r\n"); 
                       switch(UDP_HEX_Rx[13])
                         {
                            case 0:  // 图像
									 rt_kprintf("\r\n   上传固有图片\r\n");    
							       break;
							case 1:  //  音频
                                     MP3_send_start();
									  rt_kprintf("\r\n  上传固有音频 \r\n"); 
								   break;	  
							case 2:  //  视频
							        // Video_send_start();
							         // MP3_send_start();
									  rt_kprintf("\r\n  上传固有视频  不操作了 用音频\r\n"); 
								   break;	  
						    default:
								     break; 
						}				
					  
                     //----------------------------------------------------------
                     // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8804:   //    录音开始命令
		   
		            //#if  1			     
                       switch(UDP_HEX_Rx[13])
                       	{ 
                       	  case 0x00:  // 停录音
                       	                      // VOC_REC_STOP(void);
						       VOC_REC_Stop();
							/* 					  
	                                     Dev_Voice.CMD_Type='0';
										 Dev_Voice.info_sdFlag=0;    
										 Dev_Voice.Voice_FileOperateFlag=0;
										 Dev_Voice.Centre_RecordFlag=0; // 清空中心录音标志位
										 if(TF_Card_Status()==1)	
												{
												  //memset(Dev_Voice.Voice_Reg,0,512);//clear left
												  //edit_file(Dev_Voice.FileName,Dev_Voice.Voice_Reg,512); //写信息到TF
												  //Dev_Voice.Voice_FileSize+=500; //add  											  
												  rt_kprintf("\r\n ---------   语音文件的最后地址	  VoiceFileSize %d Bytes  \r\n",Dev_Voice.Voice_FileSize);
												}   
										Api_DFdirectory_Write(voice, Dev_Voice.Voice_Reg,500);  
		                                 Dev_Voice.Voice_FileSize+=500;
		                                 Sound_SaveEnd();  */
						            break;
						  case 0x01:  // 开始录音
                                                       
								     VOC_REC_Start();
						 					   
					 /*
						          if(MMedia2_Flag==0)
						          	{
                                       MP3_send_start();
									   rt_kprintf("\r\n  上传固有音频 \r\n"); 
									   MMedia2_Flag=1;
									   break;
						          	}
                                    Dev_Voice.Rec_Dur=(UDP_HEX_Rx[14]<<8)+UDP_HEX_Rx[15];
									Dev_Voice.SaveOrNotFlag=UDP_HEX_Rx[16];

                                    // ------   录音文件名 -----------
                                    if(TF_Card_Status()==1)
	                                { 
	                                    memset(Dev_Voice.FileName,0,sizeof(Dev_Voice.FileName)); 	    									
										sprintf((char*)Dev_Voice.FileName,"%d%d%d%d.spx",time_now.day,time_now.hour,time_now.min,time_now.sec);    
	                                   // creat_file(Dev_Voice.FileName); //创建文件名了 
	                                    Sound_SaveStart(); 
										rt_kprintf("\r\n			  中心录音文件名称: %s \r\n",Dev_Voice.FileName);	
										Save_MediaIndex(1,Dev_Voice.FileName,0,0);     
                                     }
                                    Dev_Voice.Centre_RecordFlag=1;//中心开始录音标志位
									              
									Dev_Voice.CMD_Type='1';
									Dev_Voice.info_sdFlag=2;									
									Dev_Voice.Voice_FileSize=0; //clear size
									Dev_Voice.Voice_FileOperateFlag=1; 
									MMedia2_Flag=0;  
					   */				
							        break;

                       	}
					  
					      
					  //------------------------------
					 //if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		   case  0x8805:   //    单条存储多媒体数据检索上传命令	---- 补充协议要求

                      reg_u32=(UDP_HEX_Rx[13]<<24)+(UDP_HEX_Rx[14]<<16)+(UDP_HEX_Rx[15]<<8)+UDP_HEX_Rx[16];
					  rt_kprintf("\r\n单条存储多媒体数据检索上传 MeidiaID=%d 删除标志: %d ",reg_u32,UDP_HEX_Rx[17]);

					  	  //------------------------------
					 // if(SD_ACKflag.f_CentreCMDack_0001H==0)
 					 {
 						 SD_ACKflag.f_CentreCMDack_0001H=1;
 						 Ack_Resualt=0;
 						 SD_ACKflag.f_CentreCMDack_resualt=Ack_Resualt;
 					 }
		              break;
		 case  0x8900:   //    数据下行透传                      
		                      if(LinkNum==0)
		                     {
                                     DataTrans.TYPE=UDP_HEX_Rx[13];
					  memset(DataTrans.DataRx,0,sizeof(DataTrans.DataRx)); 
                                     memcpy(DataTrans.DataRx,UDP_HEX_Rx+14,infolen-1);
					  DataTrans.Data_RxLen=infolen-1;   

