nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
			  //continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0002) //Bit 1 限速
			{
			
			  //continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0004) //Bit 2 进区域报警给驾驶员
			{
			
			
			  //continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0008) //Bit 3 进区域报警给平台 
			{
			  if(InOutState==0)
			  {
				 Warn_Status[1]|=0x10;// 进出区域报警
				 InOut_Object.TYPE=2;//矩形区域
				 InOut_Object.ID=i; //	ID
				 InOut_Object.InOutState=0;//  进报警		
				 rt_kprintf("\r\n -----矩形电子围栏--入报警"); 
				 break;
			  } 			
			  //continue;
			}
			 if(Rail_Rectangle.Area_attribute &0x0010) //Bit 4 出区域报警给司机
			{
			
			
			 // continue;
			}
			if(Rail_Rectangle.Area_attribute &0x0020) //Bit 5 出区域报警给平台 
			{
			  if(InOutState==1)
			   {
				 Warn_Status[1]|=0x10;// 进出区域报警
				 InOut_Object.TYPE=2;//矩形区域
				 InOut_Object.ID=i; //	ID
				 InOut_Object.InOutState=1;//  出报警		
				 rt_kprintf("\r\n -----矩形电子围栏--出报警"); 
				 break;
			   }
						
			 // continue;  
			} 

 
		}
		
	} 




}

void RouteRail_Judge(u8* LatiStr,u8* LongiStr)  
{
   /*
       纬度没有差值    1纬度  111km
       40度纬度上 1经度为  85.3km   (北京地区)
   */
     u8 i=0;
      u8 route_cout=0, seg_count=0,seg_num=0; 
      u32 Latitude=0,Longitude=0;
    // u32 DeltaLatiDis=0,DeltaLongiDis=0,CacuDist=0;
    // u8  InOutState=0;   //   0 表示 in   1  表示Out
     u32  Route_Status=0;   // 每个bit 表示 一个路线 偏航状态默认为0
     u32  Segment_Status=0;  //  当前线路中，对应端的偏航情况， 默认为0
     u32  Distance=0;
//     u8    InAreaJudge=0; //  判断是否在判断区域 bit 0 经度范围 bit  1 纬度范围
     u32  Distance_Array[6]; //存储当条线路的最小距离，默认是个大数值

       //  1. get value
	 Latitude=(LatiStr[0]<<24)+(LatiStr[1]<<16)+(LatiStr[2]<<8)+LatiStr[3];
	 Longitude=(LongiStr[0]<<24)+(LongiStr[1]<<16)+(LongiStr[2]<<8)+LongiStr[3]; 

	 // rt_kprintf("\r\n 当前---->  Latitude:   %d     Longitude: %d\r\n",Latitude,Longitude); 

      //  2.  Judge 
      for(route_cout=0;route_cout<Route_Mum;route_cout++)      // 读取路线
     { 
                 
	        // 2.1  --------   读取路线-----------	        
	        memset((u8*)&ROUTE_Obj,0,sizeof(ROUTE_Obj));  //  clear all  first        
	        DF_ReadFlash(DF_Route_Page+route_cout, 0,(u8*)&ROUTE_Obj, sizeof(ROUTE_Obj));	  
		 DF_delay_us(20);  
		//rt_kprintf("\r\n -----> ROUTE_Obj.RouteID:   %d \r\n",ROUTE_Obj.Route_ID);   
              // 2.2  -----  判断是否有效  -------
	       if((ROUTE_Obj.Effective_flag==1) &&(ROUTE_Obj.Points_Num>1)) //  判断是否有效且有拐点，若无效不处理
	      {     
	              // 2.2.0    当前段距离付给一个大的数值
	              for(i=0;i<6;i++)
				  	  Distance_Array[i]=ROUTE_DIS_Default;  
		      // 2.2.1      计算段数
                     seg_num=ROUTE_Obj.Points_Num-1; // 线路段数目
                    //  2.2.2    判断路线中每一段的状态
                     Segment_Status=0;  // 清除段判断状态，每个线路重新开始一次
			for(seg_count=0;seg_count<seg_num;seg_count++)
			{      
			          if((ROUTE_Obj.RoutePoints[seg_count+1].POINT_Latitude==0)&&(ROUTE_Obj.RoutePoints[seg_count+1].POINT_Longitude==0))
				      	{
				      	     rt_kprintf("\r\n  该点为0 ，jump\r\n"); 
					     continue;
				      	}
			      //----- 开始做距离计算, 在没在区域在函数里边做了判断
                           Distance_Array[seg_count]=Distance_Point2Line(Latitude, Longitude,ROUTE_Obj.RoutePoints[seg_count].POINT_Latitude,ROUTE_Obj.RoutePoints[seg_count].POINT_Longitude,ROUTE_Obj.RoutePoints[seg_count+1].POINT_Latitude,ROUTE_Obj.RoutePoints[seg_count+1].POINT_Longitude);   

			}
		//=========================================================	
              //  2.4 ------  打印显示距离，找出最小数值----
              Distance=Distance_Array[0];  // 最小距离  
               for(i=0;i<6;i++)
		   {
		       if(Distance>=Distance_Array[i])  
                                    Distance=Distance_Array[i];			   
		      // rt_kprintf("\r\n  Distance[%d]=%d",i,Distance_Array[i]);
                 }	 
		  rt_kprintf("\r\n MinDistance =%d  Width=%d \r\n",Distance,(ROUTE_Obj.RoutePoints[seg_num].Width>>1));	  // 

		if(Distance<ROUTE_DIS_Default)
	      {
		       //  ---- 和路段宽度做对比	   
	                 if(Distance>(ROUTE_Obj.RoutePoints[seg_num].Width>>1))
	                {
	                       rt_kprintf("\r\n 路线偏离\r\n");   
	                        Segment_Status|=(1<<seg_num);   //  把相应的bit  置位    
	                }  
		}

                     //                    
	      }  
		// 2.4  根据 2.2 结果判断当期路线状态
		if(Segment_Status)
			Route_Status|=(1<<route_cout);   //  把相应的bit  置位 
     }
     // 3.  Result
     		if(Route_Status) 
		 {
		    if( (Warn_Status[1]&0x80)==0)   //  如果以前没触发，那么及时上报
			{	  
                          PositionSD_Enable();  
				 Current_UDP_sd=1;   
		    	}
			
		    Warn_Status[1]|=0x80;// 路线偏航报警 
		    rt_kprintf("\r\n    路径偏航触发 !\r\n");           
		   
		}
		else
		{
		     if (Warn_Status[1]&0x80)   //  如果以前没触发，那么及时上报
			{	  
                             PositionSD_Enable();  
				 Current_UDP_sd=1;    
		    	}

		    Warn_Status[1]&=~0x80;// 路线偏航报警      
		}
	  

}

//--------  D点到直线距离计算-------
/*
     P1(x1,y1)   P2(x2,y2)  ,把点P(x1,y2)作为坐标原点，即x1=0，y2=0；

     那么两点P1，P2 确定的直线方程(两点式)为:
             (x-x1)/(x2-x1) =(y-y1)/(y2-y1)                          (1)
             
    注:  标准式直线方程为 AX+BY+C=0;
             那么平面上任意一点P(x0,y0) 到直线的距离表示为
             d=abs(Ax0+By0+C)/sqrt(A^2+B^2)

    其中把方程式(1) 转换成标准式为:
            (y2-y1)x+(x1-x2)y+x1(y1-y2)+y1(x2-x1)=0; 

   由于点(x1,y2)为原点  即x1=0，y2=0；  P1(0,y1) , P2(x2,0)
    所以   A=-y1 ,  B=-x2, C=y1x2
    那么 直线的方程:
                  -y1x-x2y+y1x2=0;  (2)  
 
  =>     d=abs(-y1x0-x2y0+y1x2)/sqrt(y1^2+x2^2)       (3)

         其中 (3)  为最终应用的公式 

        注:  先根据经纬度折合计算出 x0，y0，x1,y1,x2,y2  的数值单位为: 米     
=>  区域判断:
           根据(2) 可以求出  过 P1(0,y1) , P2(x2,0) 点与已知直线垂直的两条直线方程
              P1(0,y1) :      x2x-y1y+y1^2=0  (4)
              P2(x2,0) :      x2x-y1y-x2^2=0  (5)

          如果 y1 >=0      直线(4)    在直线(5)  的上边
          那么 点在线段区域内的判断方法是
                       (4) <=  0    且  (5)  >=0 
       另                
           如果 y1 <=0      直线(5)    在直线(4)  的上边
          那么 点在线段区域内的判断方法是
                       (4) >=  0    且  (5)  <=0 
   //------------------------------------------------------------------------------------------     
     
       纬度没有差值    1纬度  111km
       40度纬度上 1经度为  85.3km   (北京地区)   

       X 轴为 经度(longitude) 差值
       Y 轴为纬度 (latitude)  差值
                
     
