nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
   //------------------------------------------------------------------------------------------
*/

u32   Distance_Point2Line(u32 Cur_Lat, u32  Cur_Longi,u32 P1_Lat,u32 P1_Longi,u32 P2_Lat,u32 P2_Longi)
{   //   输入当前点 ，返回点到既有直线的距离
      long  x0=0,y0=0,Line4_Resualt=0,Line5_Resualt=0;  // 单位: 米
      long  y1=0; 
      long  x2=0;	
      long   distance=0;	 
     // long  Rabs=0;
//      long  Rsqrt=0;  
     long  DeltaA1=0,DeltaA2=0,DeltaO1=0,DeltaO2=0; //  DeltaA : Latitude     DeltaO:  Longitude 	   
     // u32   Line4_Resualt2=0,Line5_Resualt2=0; 
      double   fx0=0,fy0=0,fy1=0,fx2=0;	  
      double   FLine4_Resualt2=0,FLine5_Resualt2=0,fRabs=0,fRsqrt=0; 	  

	  // 0.   先粗略的判断 
	       DeltaA1=abs(Cur_Lat-P1_Lat); 
	       DeltaA2=abs(Cur_Lat-P2_Lat); 
		DeltaO1=abs(Cur_Lat-P1_Longi); 
	       DeltaO2=abs(Cur_Lat-P2_Longi); 
	   /* if((DeltaA1>1000000) &&(DeltaA2>1000000))	    
            {  
                rt_kprintf("\r\n  Latitude 差太大\r\n");
                return   ROUTE_DIS_Default; 
	    }	
	     if((DeltaO1>1000000) &&(DeltaO2>1000000))	    
            {  
                rt_kprintf("\r\n  Longitude 差太大\r\n"); 
                return   ROUTE_DIS_Default; 
	    }	  	
       */
	 // 1.  获取  P1(0,y1)   P2(x2,0) ,和P(x0,y0)    P(x1,y2)为原点  即x1=0，y2=0；  P1(0,y1) , P2(x2,0)
	  x2=abs(P2_Longi-P1_Longi); // a/1000000*85300=a 853/10000 m =a x 0.0853
         if(P2_Longi<P1_Longi)
		 	x2=0-x2;
	  fx2=(double)((double)x2/1000);
	 //rt_kprintf("\r\n P2_L=%d,P1_L=%d   delta=%d \r\n",P2_Longi,P1_Longi,(P2_Longi-P1_Longi));
	 // if(P2_Longi
         y1=abs(P2_Lat-P1_Lat); //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
         if(P2_Lat<P1_Lat) 
		 	y1=0-y1;
	   fy1=(double)((double)y1/1000);	  
	  //rt_kprintf("\r\n P2_LA=%d,P1_LA=%d   delta=%d \r\n",P2_Lat,P1_Lat,(P2_Lat-P1_Lat));

      //   rt_kprintf("\r\n 已知两点坐标: P1(0,%d)   P2(%d,0) \r\n", y1,x2); 
       //    当前点
	  x0=abs(Cur_Longi-P1_Longi);     
	   if(Cur_Longi<P1_Longi)
	   	x0=0-x0;
	   fx0=(double)((double)x0/1000);  
         //rt_kprintf("\r\n Cur_L=%d,P1_L=%d   delta=%d \r\n",Cur_Longi,P1_Longi,(Cur_Longi-P1_Longi));
 
         y0=abs(Cur_Lat-P2_Lat); //  a/1000000*111000=a/9.009	    
         if(Cur_Lat<P2_Lat)
		   y0=0-y0;         
	 fy0=(double)((double)y0/1000);	 
          // rt_kprintf("\r\n Cur_La=%d,P2_La=%d   delta=%d \r\n",Cur_Lat,P2_Lat,(Cur_Lat-P2_Lat)); 
        //   rt_kprintf("\r\n当前点坐标: P0(%d,%d)    \r\n", x0,y0);  
	  // 2. 判断y1  的大小， 求出过 P1(0,y1)   P2(x2,0) ,和已知直线的方程，并判断
	  //     当前点是否在路段垂直范围内
	  
             //  2.1   将当前点带入， 过 P1(0,y1)   的 直线方程(4)  求出结果
                                  Line4_Resualt=(x2*x0)-(y1*y0)+(y1*y1);
	                            FLine4_Resualt2=fx2*fx0-fy1*fy0+fy1*fy1;
	   //     rt_kprintf("\r\n Line4=x2*x0-y1*y0+y1*y1=(%d)*(%d)-(%d)*(%d)+(%d)*(%d)=%ld     x2*x0=%d    y1*y0=%d   y1*y1=%d  \r\n",x2,x0,y1,y0,y1,y1,Line4_Resualt,x2*x0,y1*y0,y1*y1); 
          //     rt_kprintf("\r\n FLine4=fx2*fx0-fy1*fy0+fy1*fy1=(%f)*(%f)-(%f)*(%f)+(%f)*(%f)=%f      fx2*fx0=%f    fy1*fy0=%f   fy1*fy1=%f  \r\n",fx2,fx0,fy1,fy0,fy1,fy1,FLine4_Resualt2,fx2*fx0,fy1*fy0,fy1*fy1); 
  
	      //   2.2   将当前点带入， 过P2(x2,0) 的 直线方程(5)  求出结果 
                                  Line5_Resualt=(x2*x0)-y1*y0-x2*x2;
		                    FLine5_Resualt2=fx2*fx0-fy1*fy0-fx2*fx2;    
		//rt_kprintf("\r\n Line5=x2*x0-y1*y0-x2*x2=(%d)*(%d)-(%d)*(%d)-(%d)*(%d)=%ld     Se : %ld   \r\n",x2,x0,y1,y0,x2,x2,Line5_Resualt,Line5_Resualt2); 
          //    rt_kprintf("\r\n FLine5=fx2*fx0-fy1*fy0-fx2*fx2=(%f)*(%f)-(%f)*(%f)-(%f)*(%f)=%f      fx2*fx0=%f    fy1*fy0=%f   fx2*fx2=%f  \r\n",fx2,fx0,fy1,fy0,fx2,fx2,FLine5_Resualt2,fx2*fx0,fy1*fy0,fx2*fx2);   
 	      // rt_kprintf("\r\n  Line4_Resualt=%d     Line5_Resualt=%d  \r\n",Line4_Resualt,Line5_Resualt);    

	     if(fy1>=0)      //  直线(4) 在上发
	  	{
               
			//   2.3   判断区域    (4) <=  0    且  (5)  >=0     // 判断条件取反
			     if((FLine4_Resualt2>0) ||(FLine5_Resualt2<0))
				 	 return   ROUTE_DIS_Default;      //  不满足条件返回最大数值
	  	}
	     else
	     	{      //  直线(5)

                   	//   2.4   判断区域     (4) >=  0    且  (5)  <=0     // 判断条件取反 
			     if((FLine4_Resualt2<0) ||(FLine5_Resualt2>0)) 
				 	 return   ROUTE_DIS_Default;      //  不满足条件返回最大数值 

	     	}	

              rt_kprintf("\r\n In judge area \r\n");  
		//rt_kprintf("\r\n   Current== Latitude:   %d     Longitude: %d     Point1== Latitude:   %d     Longitude: %d     Point2== Latitude:   %d     Longitude: %d\r\n",Cur_Lat,Cur_Longi,P1_Lat,P1_Longi,P2_Lat,P2_Longi);   

        //  3. 将差值差算成实际距离
             #if 0
		    x2=x2*0.0853; // a/1000000*85300=a 853/10000 m =a x 0.0853
                 y1=y1/9; //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
                 x0=x0*0.0853;     
		   y0=y0/9; //  a/1000000*111000=a/9.009	    
	      #else
		   fx2=fx2*0.0853; // a/1000000*85300=a 853/10000 m =a x 0.0853
                 fy1=fy1/9; //  a/1000000*111000=a/9.009	除以一百万得到度数 再乘以 111000 米得到实际距离 
                 fx0=fx0*0.0853;     
		   fy0=fy0/9; //  a/1000000*111000=a/9.009	      
             #endif

	 //  4. 计算距离 
	       //Rabs=0-y1*x0-x2*y0+y1*x2;  
              // rt_kprintf("\r\n Test -y1*x0=%d -y0*x2=%d  y1*x2=%d   Rabs=%d  \r\n",0-y1*x0,0-y0*x2,0-y1*x2,Rabs);          
	  #if 0
	       Rabs=abs(-y1*x0-x2*y0+y1*x2);   
	       Rsqrt=sqrt(y1*y1+x2*x2); 
	        // distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2); 
	       distance=Rabs/Rsqrt;
	  // rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);        
        #else
             	fRabs=abs(-fy1*fx0-fx2*fy0+fy1*fx2);   
	       fRsqrt=sqrt(fy1*fy1+fx2*fx2); 
	        // distance=abs(-y1*x0-x2*y0-y1*x2)/sqrt(y1*y1+x2*x2); 
	       distance=(long) ((fRabs/fRsqrt)*1000);
	       // rt_kprintf("\r\n Rabs=%d    Rsqrt=%d   d=%d",Rabs,Rsqrt,distance);      
	  #endif
	  
	     
     return   distance;
}




 unsigned short int CRC16_file(unsigned short int num)  
{
#if  0
 unsigned short int i=0,j=0;
 unsigned char buffer_temp[514];
   memset(buffer_temp,0,sizeof(buffer_temp));
   for(i=0;i<num;i++)
	{
		if(i==0)   //第一包
			{
			Last_crc=0;   // clear first  
			crc_fcs=0;
			buffer_temp[0]=0;
	        buffer_temp[1]=51;
	        DF_ReadFlash(51,0,&buffer_temp[2],PageSIZE);
			 WatchDog_Feed(); 
			
			Last_crc=CRC16_1(buffer_temp,514,0xffff);
			rt_kprintf("\r\ni=%d,j=%d,Last_crc=%x",i,j,Last_crc);
			}
		else if(i==(num-1))  //最后一包
			{
            buffer_temp[0]=0;
	        buffer_temp[1]=50;
	        DF_ReadFlash(50,0,&buffer_temp[2],PageSIZE);
			FileTCB_CRC16=((unsigned short int)buffer_temp[512]<<8)+(unsigned short int)buffer_temp[513];
			crc_fcs=CRC16_1(buffer_temp,512,Last_crc);
			rt_kprintf("\r\ni=%d,j=%d,Last_crc=%x ReadCrc=%x ",i,j,crc_fcs,FileTCB_CRC16);
			}
		else  
			{             // 中间的包
			 j=i+51;
			 buffer_temp[0]=(char)(j>>8);
			 buffer_temp[1]=(char)j;
			 DF_ReadFlash(j,0,&buffer_temp[2],PageSIZE);
			 WatchDog_Feed(); 
			Last_crc=CRC16_1(buffer_temp,514,Last_crc);
			//rt_kprintf("\r\ni=%d,j=%d,Last_crc=%d",i,j,Last_crc);
			}
	   }
rt_kprintf("\r\n  校验结果 %x",crc_fcs);
return crc_fcs;
#endif
		  return 1;
}



//-------  JT808  Related   Save  Process---------
void  Save_Status(u8 year,u8 mon,u8 day,u8 hour,u8 min,u8 sec)
{   // 存储事故疑点 最近20s车辆的状态字，和当前最近的有效位置信息  

       
		u16 wr_add=3,j=0,cur=0;   
		u8	FCS;	 
		u8  regDateTime[6];		
		static uint8_t Statustmp[500]; 
//		u32  latitude=0,longitude=0;    
 
                       Time2BCD(regDateTime);  
                       //----------------------------------------------------------------------------
					   wr_add=0; 
					   memcpy(Statustmp,regDateTime,6);
					   wr_add+=6;		   
					   //-----------------------  Status Register   --------------------------------
					 cur=save_sensorCounter;  //20s的事故疑点
					 for(j=0;j<100;j++)
					 {
                         Statustmp[wr_add++]=Sensor_buf[cur].DOUBTspeed;    //速度
						 Statustmp[wr_add++]=Sensor_buf[cur].DOUBTstatus;   //状态    
                         cur++;
						 if(cur>100)
						 	cur=0;                            
					 }           
					 //---------------------------------------------------------------------------------------
					 FCS = 0;  
					 for( j=0;j<wr_add;j++)    
					 {
						FCS ^=Statustmp[j];	            
					 }				//求上边数据的异或和      不算校验 信息长度为   206
					 //------------------------------------------------------------------------------
					 Statustmp[wr_add++]=FCS; 
					   //----------------------------------------------------------------------------- 	 
					   rt_kprintf("\r\n 存储行车记录  Record  write: %d    SaveLen: %d    \r\n",Recorder_write,wr_add); 
                                      Api_DFdirectory_Write(doubt_data,Statustmp, wr_add);

					   
