nathanlnw/HB_LOCAL_TakePhoto/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/protocol_808.c
}
//-----------------------------------------------------------------------------------
void Save_AvrgSpdPerMin(void) 
{ /*
     Note: 存储单位小时每分钟平均速度 
  */
  u8   content[70];
  u8   saveLen=0,FCS=0,i;   
    
	 saveLen=0; 
	 memset(content,0,70);
	 memcpy(content+saveLen,Avrgspd_Mint.datetime_Bak,5);    //用BAKtime
	 saveLen+=5;
	 memcpy(content+saveLen,Avrgspd_Mint.avgrspd,60);    //用BAKtime
	 saveLen+=60;  
  //---------------------------------------------------------------------------------------
  FCS = 0;
  for ( i = 0; i < 69; i++ ) 
  {
	 FCS ^=content[i];    
  } 			 //求上边数据的异或和   
  content[69] = FCS;	 // 第8字节	       
  //----------------------------------------------------------------------------------------  
  Api_DFdirectory_Write(spdpermin, content, 70); 
  //-----------------------------------------------------------------
  memset(Avrgspd_Mint.avgrspd,0,60); // 存储后清除记录     
   if(DispContent)
        rt_kprintf("\r\n   存储单位小时每分钟平均速度   Save Time %X-%X-%X %x:%x     \r\n",\
  	Avrgspd_Mint.datetime_Bak[0],Avrgspd_Mint.datetime_Bak[1],\
  	Avrgspd_Mint.datetime_Bak[2],Avrgspd_Mint.datetime_Bak[3],Avrgspd_Mint.datetime_Bak[4]);   
  
}

  void Spd_Exp_Wr(void)
  {	
     u8  content[40];
     u8  wr_add=0,i=0,FCS=0; 	 

	 memset(content,0,sizeof(content));
	memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
	wr_add+=18;
	memcpy(content+wr_add,speed_Exd.ex_startTime,6);
	wr_add+=6;
	memcpy(content+wr_add,speed_Exd.ex_endTime,6);  
	wr_add+=6; 
	content[wr_add++]=speed_Exd.current_maxSpd/10; 

       FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(spd_warn, (u8 *)content, 32); 
	  //----------- debug -----------------------
	  rt_kprintf("\r\n 超速报警  %X-%X-%X %X:%X:%X,MaxSpd=%d\r\n",speed_Exd.ex_endTime[0],speed_Exd.ex_endTime[1],speed_Exd.ex_endTime[2],speed_Exd.ex_endTime[3],speed_Exd.ex_endTime[4],speed_Exd.ex_endTime[5],speed_Exd.current_maxSpd); 
     //--------- clear status ----------------------------
     Spd_ExpInit(); 

  }

void Save_TiredDrive_Record(void)
{
  u8   content[40];
  u8   wr_add=0,FCS=0,i; 

        wr_add=0; 
	 memset(content,0,70);

	  Time2BCD(TiredConf_struct.Tired_drive.end_time); 
	 
         memcpy(content+wr_add,JT808Conf_struct.Driver_Info.DriverCard_ID,18);
	  wr_add+=18;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.start_time,6);
	  wr_add+=6;
	  memcpy(content+wr_add,TiredConf_struct.Tired_drive.end_time,6);
	  wr_add+=6; 

	      FCS = 0;
	   for ( i = 0; i < 32; i++ )  
	   {
			 FCS ^=content[i];
	   }			  //求上边数据的异或和
	   content[wr_add++] = FCS;	  // 第31字节 
	   
       Api_DFdirectory_Write(tired_warn, (u8 *)content, 32); 
       //-----  clear status ---------------  
	  TIRED_Drive_Init();      
	  Status_TiredwhRst=0;
	 // DF_WriteFlashSector(DF_TiredStartTime_Page,0,(u8*)&Status_TiredwhRst,1); //清除O后要写入		
	   TIRED_Drive_Init(); //	休息了 
	   Warn_Status[3]&=~0x04;  //BIT(2)	疲劳驾驶  

}


void  JT808_Related_Save_Process(void)
{
u8 i=0;

       if(DF_LOCK)
	   	 return ;

	      if(Dev_Voice.CMD_Type!='1')  // 录音时不做以下处理  
      {           

		//-------------------------
		//    存储疑点数据
		if(1==NandsaveFlg.Doubt_SaveFlag) 
		{
			if(sensor_writeOverFlag==1)	
			{ 
			  time_now=Get_RTC();     //  RTC  相关 
			  Save_Status(time_now.year,time_now.month,time_now.day,time_now.hour,time_now.min,time_now.sec);
			  NandsaveFlg.Doubt_SaveFlag=0;
			  return;
			} 
		} 							 
		//  存储每分钟速度信息  
		if(1==Avrgspd_Mint.saveFlag) 
		{
			/*rt_kprintf("\r\n  %x/%x/%x   %x:%x\r\n",Avrgspd_Mint.datetime_Bak[0],Avrgspd_Mint.datetime_Bak[1],Avrgspd_Mint.datetime_Bak[2],Avrgspd_Mint.datetime_Bak[3],Avrgspd_Mint.datetime_Bak[4]);
			for(i=0;i<60;i++)
				{
				if(i%10==0)
					rt_kprintf("\r\n");
				rt_kprintf("  %2d",Avrgspd_Mint.avgrspd[i]);
				}
			rt_kprintf("\r\n");*/

		
			Save_AvrgSpdPerMin();
			Avrgspd_Mint.saveFlag=0; 
			return;
		}							  	  

		//-----------------  存储疲劳驾驶记录 ---------------			
		if( TiredConf_struct.Tired_drive.Tireddrv_status==2)   
		{
	             Save_TiredDrive_Record();
			return;	 
		}			
		//-----------------  超速报警 ----------------------
		if(speed_Exd.excd_status==2)
		{
		   Spd_Exp_Wr();   
		   return;
		}   
		 /*
		if(NandsaveFlg.Setting_SaveFlag==1)   // 参数 修改记录
		{
		  Save_Common(Settingchg_write,TYPE_SettingChgAdd); 
		  Settingchg_write++;
		  if(Settingchg_write>=Max_CommonNum)  
		  	Settingchg_write=0; 
		  DF_Write_RecordAdd(Settingchg_write,Settingchg_read,TYPE_SettingChgAdd);   
		  NandsaveFlg.Setting_SaveFlag=0; // clear flag
		} 
		*/
			
      	}           
	//	 定时存储里程
	if((Vehicle_RunStatus)&&((Systerm_Reset_counter&0xff)==0xff))
	{   //  如果车辆在行驶过程中，每255 秒存储一次里程数据    
                Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct)); 
		  return;		
	} 
			
	 //--------------------------------------------------------------

}

u8   Time_FastJudge(void) 
{
        u32  Date_value1=0,Time_value1=0;
	 u32  Date_valueRTC=0,Time_valueRTC=0;	 

	  Date_value1=Gps_Gprs.Date[0]*365+Gps_Gprs.Date[1]*30+Gps_Gprs.Date[2];	  	
	  Date_valueRTC=time_now.year*365+time_now.month*60+time_now.day;
         Time_value1=Gps_Gprs.Time[0]*3600+Gps_Gprs.Time[1]*60+Gps_Gprs.Time[2];
	  Time_valueRTC=time_now.hour*3600+time_now.min*60+time_now.sec;  
	  
        if(Date_value1>Date_valueRTC)
		{ 
		     rt_kprintf("\r\n  日期超前，Kick  OUT  !\r\n");
		     StatusReg_GPS_V();	  //  不定位
		     return false;
        	}	 
        if((Time_value1>Time_valueRTC) &&((Time_value1-Time_valueRTC)>120))
        	{
                  rt_kprintf("\r\n  时间超前，Kick  OUT  !\r\n");
		    StatusReg_GPS_V();	// 不定位	  
		     return false;
        	}
        return true;

}

void  localtrig(u8 *instr)
{
    
     local_trig=instr[0]-0x30;
     
     if(local_trig==1)
	     GPS_getfirst=1; 
     else
     if(local_trig==2)
	      GPS_getfirst=2; 	
     else
	     GPS_getfirst=0; 	
     rt_kprintf("\r\n Enable local  time=%d  \r\n",local_trig);    
}
FINSH_FUNCTION_EXPORT(localtrig, localtrig);  


 void dnsr1set(u8 *content)
 {
       u8  instr[50];

		         memset(instr,0,sizeof(instr));
			  memcpy(instr,content, strlen(content));
      	                rt_kprintf("\r\n  域名: %s \r\n",content); 
					  
					  memset(DomainNameStr,0,sizeof(DomainNameStr));					  
					  memset(SysConf_struct.DNSR,0,sizeof(DomainNameStr));
					  memcpy(DomainNameStr,(char*)content,strlen(content));   
					  memcpy(SysConf_struct.DNSR,(char*)content,strlen(content));   
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));

                                     //----- 传给 GSM 模块------
                                    DataLink_DNSR_Set(SysConf_struct.DNSR,1);  



 }
 FINSH_FUNCTION_EXPORT(dnsr1set, dnsr1set);  
// C.  Module
